function getStaffs () {
  return [
    {
      name: '马逸清',
      jobTitle: '前端开发工程师',
      graduate: '2013 年毕业于上海大学',
      avatar: '/static/img/staffs/myq.png',
      content: '由于提供的是技术类的产品，业务和技术的关系非常紧密，这也让我们的技术氛围比较好，是比较典型的工程师文化。我们喜欢思考问题的本质，尽量用简单的规则和办法去解决看似复杂的问题。这也是公司一直以来崇尚的文化，简单可信赖。'
    },
    {
      name: '宋文灏',
      jobTitle: '后端开发工程师',
      graduate: '2016年毕业于上海交通大学',
      avatar: '/static/img/staffs/swh.png',
      content: '如果你能够自发性地学习，希望得到快速的成长，希望尝试和大公司不一样的工作体验，有追求有理想，觉得年轻的时候不奋斗一下有点可惜，那么七牛对你来说可能是个不错的选择。'
    },
    {
      name: '邵羽',
      jobTitle: '后端开发工程师',
      graduate: '2016年毕业于浙江大学',
      avatar: '/static/img/staffs/sy.png',
      content: '我是 2015 年 5 月 25 日加入七牛的。碰巧的是，我的入党日期也是 5 月 25 日，当时就有朋友开玩笑说在“我爱我”日这一天加入中国共产党是你送给自己最好的礼物，如今我也同样自豪的认为：在这一天加入七牛是我送给自己最好的礼物。'
    },
    {
      name: '陈心',
      jobTitle: '后端开发工程师',
      graduate: '2015 年毕业于浙江大学',
      avatar: '/static/img/staffs/cx.png',
      content: '我是个比较害羞的人，对人际交往很不在行。但是七牛真的让人很放松，没有多余的社交，大家都专心做手头上的事情，在工作中建立友情。这是一家简单的公司，但是大家一起努力做着不简单的事。'
    },
    {
      name: '罗轶斯',
      jobTitle: '活动运营专员',
      graduate: '2015 年毕业于四川音乐学院',
      avatar: '/static/img/staffs/lys.png',
      content: '七牛给我的最大的感觉就是，工作氛围很好。在工作中，每一位小伙伴从专员到 CMO，每个人都在认真负责着自己的工作，毫不懈怠，我觉得年轻人就应该在这种工作圈中工作，才会得到提升。所以一直庆幸选择了七牛。'
    },
    {
      name: '常龙',
      jobTitle: '销售管培生',
      graduate: '2016 年毕业于东北石油大学',
      avatar: '/static/img/staffs/cl.png',
      content: '在七牛，你的个性可以得到充分的发挥。你不要担心别人会束缚你，你只需要尽情的舒展自己。所以在七牛，我有一种恋爱的感觉，这儿的环境很舒畅，让你不自觉的就融入其中。大家都是那么努力，所以你也在努力，让自己成为一个更好的自己。'
    }
  ]
}

export {getStaffs}
