var jobInfo = {
    "tech": [{
        "id": "0",
        "job_title": "后端开发工程师",
        "place": [
            "上海",
            "北京"
        ],
        "time": "2016/9/1",
        "duty": [
            "在团队协作下，参与七牛服务后台的架构设计、开发、优化及运营工作",
            "使用优秀的架构设计及算法实现，保证后台支撑系统的稳定、安全、高效和可靠"
        ],
        "requirements": [
            "本科及以上学历，计算机相关专业，基础扎实",
            "熟悉至少一门后端语言，包括但不限于Go/Java/C/C++/Python/NodeJS/Ruby/PHP",
            "熟悉 Linux 工作环境，熟悉至少一种数据库编程",
            "熟悉 TCP/IP 协议栈及相关编程",
            "熟悉虚拟化相关技术，SDN 相关技术、分布式存储相关技术优先",
            "良好的数据结构和算法基础,良好的工程素养以及关于技术文档的基本阅读与理解能力",
            "有过服务端开发经验的优先"
        ],
        "pro": [
            "fresh@qiniu.com"
        ]
    }, {
        "id": "1",
        "job_title": "前端开发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/9/1",
        "duty": [
            "配合产品经理和设计师快速实现前端界面，优化代码并保持良好兼容性",
            "持续改进当前产品的前端功能，优化性能，改善访问体验",
            "有良好的文档能力，依据需求产出技术方案"
        ],
        "requirements": [
            "本科及以上学历，计算机相关专业，基础扎实",
            "良好的沟通能力，能与设计师及产品经理高效协作",
            "掌握 HTML/HTML5，CSS/CSS3, 代码结构清晰可读，易于维护",
            "熟练掌握 JavaScript，熟悉主流 JavaScript 框架及库",
            "对跨浏览器兼容性问题有一定了解",
            "对优化网站性能有一定了解"
        ],
        "pro": ["fresh@qiniu.com"]
    }, {
        "id": "2",
        "job_title": "大数据开发工程师",
        "place": [
            "杭州"
        ],
        "time": "2016/9/1",
        "duty": [
            "参与数据技术与产品部核心产品的研发"
        ],
        "requirements": [
            "本科及以上学历，计算机相关专业，基础扎实",
            "熟悉 Linux 的 Shell 命令，灵活运用 Shell 做文本处理和系统操作",
            "熟练掌握一门或多门编程语言，参与过大型项目者优先，熟悉 Golang，Scala 者优先",
            "具有丰富的海量数据 ETL 加工处理经验",
            "有从事分布式数据存储与计算平台应用开发经验，熟悉 Hadoop，Spark，HBase，Cassandra 及 Hive 等",
            "有从事实时计算的经验，如 Spark Sreaming 及 Storm 等",
            "给著名开源项目提交过代码者优先，如 Hadoop，Spark 及 Docker 等",
            "优秀的沟通与表达能力及较强的自我驱动能力"
        ],
        "pro": [
            "fresh@qiniu.com"
        ]
    }, {
        "id": "3",
        "job_title": "测试开发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/9/1",
        "duty": [
            "设计、开发、执行及维护自动化测试",
            "测试环境自动化发布及管理维护",
            "参与需求讨论和跟踪，快速理解需求点并分析风险",
            "与开发人员密切配合，推动质量保证流程",
            "对新技术具有很强的好奇心，能够快速将新想法融入解决方案"
        ],
        "requirements": [
            "熟悉至少一门主流语言：C/C++/Java/Python/Go/Erlang/Scala 等",
            "具备较强的逻辑思维及分析能力，掌握测试用例设计",
            "具备高度的责任心，热爱开发及测试工作，具有很强的适应能力",
            "活跃在各个技术社区，有较好的文档写作习惯优先",
            "具有测试或开发实习经验，熟悉软件测试理论和软件测试流程者优先"
        ],
        "pro": []
    }, {
        "id": "4",
        "job_title": "机器学习软件工程师",
        "place": [
            "上海",
            "杭州",
            "北京"
        ],
        "time": "2016/9/1",
        "duty": [
            "机器学习方向技术平台软件开发",
            "开发一套持续迭代演进的机器学习系统，不断优化系统，提高系统效率",
            "算法和模型的优化，包括但不限于：计算机视觉识别算法，语音识别算法，NLP 算法等",
            "将技术创新推向亿万用户"
        ],
        "requirements": [
            "本科及以上学历，统计学、应用数学、计算机相关专业、基础扎实",
            "Fast Learners more than experts，七牛不关注你的经验，但是你要有快速学习的能力，宽泛的技术视野，创造性思维，富有想象力，有推进人工智能的理想和使命感",
            "熟练掌握机器学习领域基本概念和基础算法者优先，并在如下一个或多个相关方向有深入研究：计算机视觉识别算法，语音识别算法，NLP 算法等",
            "熟练掌握机器学习者优先，尤其是深度学习，基本算法并有丰富的实践经验者优先",
            "熟练掌握C/C++和脚本语言编程(如Shell/Python等)",
            "在计算机视觉国际顶级会议或者期刊上发表论文，相关国际比赛获奖，及有相关专利者优先"
        ],
        "pro": ["fresh@qiniu.com"]
    }, {
        "id": "5",
        "job_title": "运维工程师",
        "place": [
            "上海",
            "北京"
        ],
        "time": "2016/9/1",
        "duty": [
            "负责 CDN 分发网络系统的规划、设计、建设、运维和优化，保证线上服务稳定运行",
            "负责自动化运维平台的设计与开发",
            "算法和模型的优化，包括但不限于：计算机视觉识别算法，语音识别算法，NLP 算法等",
            "负责统一沟通平台的建设与技术支撑，平台功能与性能的不断完善"
        ],
        "requirements": [
            "本科及以上学历，计算机相关专业，基础扎实",
            "对分布式集群、架构、开源技术有火一样的热情",
            "深入理解 Linux 操作系统、体系结构",
            "至少精通一门开发语言，如C/Python/Shell/Perl等",
            "有良好的编程基础和 Debug 能力，熟悉网络知识及典型协议原理"
        ],
        "pro": ["fresh@qiniu.com"]
    }, {
        "id": "6",
        "job_title": "实施工程师",
        "place": [
            "上海"
        ],
        "time": "2016/9/1",
        "duty": [
            "负责业务应用系统的审核、部署、发布、监控、维护和优化",
            "负责突发事件管理，问题跟踪与管理，保障系统 24×7 稳定运行",
            "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
            "协调开发部门，配置管理，基础运维，更好提供服务"
        ],
        "requirements": [
            "本科及以上学历，计算机相关专业，基础扎实",
            "对分布式集群、架构、开源技术有火一样的热情",
            "深入理解 Linux 操作系统、体系结构",
            "至少精通一门开发语言，如C/Python/Shell/Perl等",
            "有良好的编程基础和 Debug 能力，熟悉网络知识及典型协议原理"
        ],
        "pro": ["fresh@qiniu.com"]
    }, {
        "id": "7",
        "job_title": "技术支持工程师",
        "place": [
            "上海"
        ],
        "time": "2016/9/1",
        "duty": [
            "代表公司接入并服务客户",
            "参与改善公司客户服务流程，参与开发客户服务内部系统",
            "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
            "根据客户需求，帮助公司改善产品甚至探讨方向、策略"
        ],
        "requirements": [
            "本科及以上学历、计算机相关专业、基础扎实",
            "熟悉 TCP/HTTP 协议，熟悉 CDN & DNS 基本原理",
            "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
            "热爱分享，较好的文档写作能力",
            "对互联网市场敏锐，能够深刻理解、消化并满足市场、客户需求",
            "自信，擅表达，喜欢演讲，敢于用正确的逻辑、温柔的言语去挑战权威"
        ],
        "pro": ["fresh@qiniu.com"]
    }, {
        "id": "8",
        "job_title": "售前咨询工程师",
        "place": [
            "北京",
            "上海"
        ],
        "time": "2016/9/1",
        "duty": [
            "随同商务人员拜访客户，进行价值陈述，梳理客户技术需求及痛点，促成测试意向",
            "撰写项目解决方案，协调公司内部资源进行重大项目支撑",
            "协助客户对接和测试各项云服务，并引导客户调整技术架构",
            "观察云行业业态，持续分析业务发展趋势，撰写行业解决方案",
            "参与 IT 会议，宣传七牛理念、服务与解决方案"
        ],
        "requirements": [
            "具备扎实的计算机理论知识和优秀的编程思路，计算机科学与技术、网络工程，通信工程等相关专业大学本科以上学历",
            "优秀的沟通表达能力，具备独立思考能力，有较好的客户服务意识，有较强的抗压能力",
            "热爱销售，有良好的抗压能力熟练使用 office，能够进行技术方案的编写",
            "精通 DNS 原理，熟悉 Nginx，ATS，Squid 等代理软件",
            "熟悉 openstack，spark，docker 等开源技术，有云存储，云计算，云直播，CDN 等相关行业经验优先"
        ],
        "pro": ["fresh@qiniu.com"]
    }],
    "business": [],
    "product": [],
    "design": [],
    "marketing": [{
        "id": "0",
        "job_title": "销售管培生",
        "place": [
            "上海",
            "北京",
            "深圳",
            "广州",
            "杭州"
        ],
        "time": "2016/9/1",
        "duty": [
            "协助大客户经理建立销售计划和各种业务拓张",
            "挖掘公司目标客户，进行日常客户沟通联络和业务拓展",
            "进行客户关系的管理，整理、维护和分析客户资料",
            "完成公司指定的销售指标"
        ],
        "requirements": [
            "本科以上学历，计算机等技术相关专业优先",
            "沟通能力强，乐于和善于表达",
            "热爱销售，有良好的抗压能力",
            "自信、乐观向上、工作态度积极、具有团队合作精神",
            "乐于接受新鲜事物，学习能力强"
        ],
        "pro": [
            "fresh@qiniu.com"
        ]
    }],
    "function": []
};



var cityList = [{
    "id": 0,
    "city": "广州",
    "place": "华南理工大学",
    "time": "9 月 20 日（周二）19:00",
    "room": "大学城 A4-301"
}, {
    "id": 1,
    "city": "合肥",
    "place": "中国科学科技大学",
    "time": "9 月 21 日（周三）15:30",
    "room": "西区学生活动中心（一楼）报告厅"
}, {
    "id": 2,
    "city": "南京",
    "place": "南京大学",
    "time": "9 月 22 日（周四）19:00",
    "room": "十食堂就业中心 303B"
}, {
    "id": 3,
    "city": "上海",
    "place": "上海大学",
    "time": "9 月 23 日（周五）18:30",
    "room": "宝山校区乐乎新楼 2 号楼思源厅"
}, {
    "id": 4,
    "city": "北京",
    "place": "北京邮电大学",
    "time": "9 月 27 日（周二）19:00",
    "room": "教三 539"
}, {
    "id": 5,
    "city": "武汉",
    "place": "华中科技大学",
    "time": "9 月 28 日（周三）19:00",
    "room": "大学生活动中心 305"
}, {
    "id": 6,
    "city": "上海",
    "place": "同济大学",
    "time": "10 月 8 日（周六）18:00",
    "room": "嘉定校区济人楼 405"
}];
