var jobInfo = {
    "tech": [],
    "business": [],
    "product": [],
    "design": [],
    "marketing": [],
    "function": []
};



var cityList = [{
    "id": 0,
    "city": "广州",
    "place": "华南理工大学",
    "time": "9 月 20 日（周二）19:00",
    "room": "大学城 A4-301"
}, {
    "id": 1,
    "city": "合肥",
    "place": "中国科学科技大学",
    "time": "9 月 21 日（周三）15:30",
    "room": "西区学生活动中心（一楼）报告厅"
}, {
    "id": 2,
    "city": "南京",
    "place": "南京大学",
    "time": "9 月 22 日（周四）19:00",
    "room": "十食堂就业中心 303B"
}, {
    "id": 3,
    "city": "上海",
    "place": "上海大学",
    "time": "9 月 23 日（周五）18:30",
    "room": "宝山校区乐乎新楼 2 号楼思源厅"
}, {
    "id": 4,
    "city": "北京",
    "place": "北京邮电大学",
    "time": "9 月 27 日（周二）19:00",
    "room": "教三 539"
}, {
    "id": 5,
    "city": "武汉",
    "place": "华中科技大学",
    "time": "9 月 28 日（周三）19:00",
    "room": "大学生活动中心 305"
}, {
    "id": 6,
    "city": "上海",
    "place": "同济大学",
    "time": "10 月 8 日（周六）18:00",
    "room": "嘉定校区济人楼 405"
}];
