var jobInfo = {
    "tech": [{
            "id": "0",
            "job_title": "资深图片算法开发工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "负责图片算法的改进、优化"
            ],
            "requirements": [
                "熟悉 C 语言，扎实的 C 语言基础",
                "熟悉一门脚本语言，比如 Python、Bash 等",
                "熟悉 Linux 操作系统，对多线程、并发编程有深入了解",
                "对常见的图片格式，比如 JPEG、PNG、WebP 有所了解，能根据需要改进算法",
                "对 ImageMagick、GraphMagic 等图片算法开源库有一定了解，能根据需要调试、优化、改进算法",
                "良好沟通能力，对编程、技术有热情，态度积极",
                "熟悉图片处理的常见算法，并能将之工程化",
                "有 GPU 算法经验者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "1",
            "job_title": "数据处理 & 分析开发工程师 ",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "直播 SDK & 流媒体服务器日志收集",
                "日志数据的实时计算处理和离线计算处理",
                "依托于质量数据做直播产品的质量运营和线路调优，能够反映七牛直播云的网络拓普质量，体现数据价值",
                "通过机器学习能够做到实时或者预测线路质量，实现最终自动化运营的目标"
            ],
            "requirements": [
                "具备流式日志数据的收集知识，对于离线&实时日志数据的存储和计算有一定经验",
                "了解 Flume，Kafka，Spark&Storm，Hadoop，Hive 等技术",
                "对于数据挖掘和运营分析有一定经验",
                "最好具备可视化 MVC 系统的开发知识，掌握 Go，Java，Python 等其中至少一门开发语言",
                "有 CDN 调度系统的研发、调优经验者优先",
                "了解一定 HTML，CSS，JS 等前端知识",
                "最好具备一定机器学习的背景"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "2",
            "job_title": "测试开发工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "设计、开发、执行及维护自动化测试",
                "测试环境自动化发布及管理维护",
                "参与需求讨论和跟踪，快速理解需求点并分析风险",
                "与开发人员密切配合，推动质量保证流程",
                "对新技术具有很强的好奇心，能够快速将新想法融入解决方案"
            ],
            "requirements": [
                "2 年以上的测试或者开发经验",
                "熟悉软件测试理论和软件测试流程",
                "具备较强的逻辑思维及分析能力，熟练掌握测试用例设计",
                "精通和熟悉至少以下主流语言中的 1 门：C/C++/Java/Python/Go/Erlang/Scala 等，有 Java 经验者优先",
                "具备高度的责任心，热爱开发及测试工作，具有很强的适应能力",
                "活跃在各个技术社区，较好的文档写作习惯（加分项)"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "3",
            "job_title": "前端开发工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "配合产品经理和设计师快速实现一流的前端界面，优化代码并保持良好兼容性",
                "持续改进当前产品的前端功能，优化性能，改善访问体验",
                "参与产品的需求分析和功能设计过程，帮助最优化产品的设计",
                "主导前端框架的设计和开发"
            ],
            "requirements": [
                "精通 HTML/XHTML、CSS，熟悉页面架构和布局，对 Web 标准和标签语义化有深入理解",
                "熟练使用常见的 JavaScript 类库，如 AngularJS 等",
                "精通至少一门后台语言，如 Golang（我们的后台语言）、PHP、Python、Ruby 等",
                "对前端工程化与模块化开发有实践经验",
                "优秀的团队协作及沟通能力，有团队管理经验者优先考虑",
                "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物",
                "两年以上实际项目中的前端开发经验"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "4",
            "job_title": "IDC 运维工程师",
            "place": [
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "服务器硬件选型及容量规划，硬件运维及故障跟踪",
                "统筹机房现场环境实施和交付，上架和调试，做好项目管理",
                "Linux 系统、服务器运维工作，包括：安装部署、系统监控、故障定位恢复、系统安全、性能优化等",
                "运维工具规划与建设，新技术研究和应用"
            ],
            "requirements": [
                "本科及以上学历、有 1 年以上互联网系统、服务器运维经验，优秀的学习能力和故障排查经验",
                "良好的沟通和项目管理能力，对运维工作有浓厚兴趣，能够承受较大的工作压力，对行业技术敏感度高，责任心强",
                "了解网络架构，熟悉服务器、网络硬件相关知识，深入理解 Linux 系统，精通 Shell、Awk 等工具，能熟练使用 Python/Shell 之一来开发运维工具",
                "熟悉常用开源软件的安装、配置和使用",
                "熟悉 TCP/IP 协议，熟悉 DNS、NTP、HTTP、MySQL 等",
                "掌握 4-7 层负载均衡运维部署及性能调优（如 LVS、NAT、HAProxy、NGINX ），会内核调优的优先考虑",
                "有大规模服务器自动化安装、自动化运维经验的优先考虑"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "5",
            "job_title": "网络工程师",
            "place": [
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "负责数据中心机房运维及优化，及时排除网络故障，保证网络稳定运行",
                "处理公司业务部门提交的各类网络事务和问题",
                "构建网络平台的运行状态监控"
            ],
            "requirements": [
                "计算机及相关专业本科学历，2 年以上网络技术相关工作经验",
                "良好的沟通表达能力，吃苦耐劳，乐观上进，做事认真，仔细，负责，能够 7x24 响应突发事件",
                "熟悉 TCP/IP 协议，OSPF、ISIS、BGP 等常用路由协议，熟悉常用网络技术如 PBR、ECMP、NAT、VPN、QOS、VRRP、VLAN、ACL、STP 等二三层通信、安全相关技术",
                "熟练掌握常见网络问题的排障技巧，并理解原理；具有较强的实际操作能力、分析能力",
                "熟悉主流厂商的网络设备，如 Cisco、H3C、华为交换机、路由器的基础配置和功能实现，基本的设备软硬件故障定位",
                "有大型网络的规划、设计、运维及优化经验者优先",
                "有熟练 Linux 系统技能和基本的运维开发能力（Python、Shell）者优先",
                "有 CCIE、H3C、华为等高级认证者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "6",
            "job_title": "运维开发工程师 ",
            "place": [
                "上海",
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "保证七牛 CDN 平台稳定性，制定和优化运维解决方案，主导业务架构的可运维性设计，设计与开发高效的自动化运维系统"
            ],
            "requirements": [
                "3 年以上运维开发经验，对立体监控、自动部署、容量管理、自动容灾有较深入的理解和实践",
                "熟练掌握 C/PHP/Python/Shell等 1-2 种语言，并有相关运维开发经验；",
                "熟悉 Linux 工作环境，熟悉至少一种数据库编程",
                "快速定位和分析客户所遇问题，快速提供最佳解决方案",
                "有实际的运维工作经验，精通 Linux 操作系统、TCP/IP 常用协议，熟悉 CDN & DNS 基本原理"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "7",
            "job_title": "安全工程师 ",
            "place": [
                "上海",
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "负责七牛所有业务系统的安全（包括应用安全、主机安全、网络安全）",
                "负责例行安全检查、漏洞跟踪处理、解决方案制定",
                "负责公司的安全应急响应的处理。能够及时响应突发安全事件",
                "负责员工安全意识，安全技术的培训工作",
                "负责最新的安全漏洞研究，最新安全动态的跟踪与探索"
            ],
            "requirements": [
                "2-3 年互联网公司安全工作经验",
                "对常见的安全漏洞 (Web、系统) 的原理、危害、利用方式及解决方案有深入的理解并有丰富的经验。（有独立渗透测试经验或在各漏洞平台上报过漏洞者优先）",
                "具备独立对应用进行黑盒、白盒安全测试的能力",
                "熟练掌握一门开发语言（如 Java、PHP、Python 等）并可开发简单工具",
                "对移动安全有所了解，熟悉加固、反编译、漏洞挖掘及解决方案等",
                "具有踏实的工作心态、良好的沟通能力和团队协作能力"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "8",
            "job_title": "监控专员 ",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "由值班组长安排值班，值班期间接收系统告警并通知和协助相关人员处理",
                "监控系统的日常维护，包括添加监控项、修改告警条件"
            ],
            "requirements": [
                "熟练使用 Linux 基本命令，如：top、iostat 等",
                "满足以下条件者优先",
                "熟悉 Linux 日常操作命令 ",
                "会使用任意一种语言编写脚本，如 Bash、Python",
                "有监控团队工作经验",
                "使用过任意一个或多个监控系统，如：Zabbix、Nagios ",
                "有一种或多种业余爱好，如：游戏、电影、漫画"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "9",
            "job_title": "后端开发工程师（CDN） ",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "负责七牛网络加速相关子系统的架构设计与研发工作",
                "负责流量系统、计费系统、刷新系统、发布系统、质量系统的设计与开发工作",
                "带领团队，通过开发各种网络加速业务系统，让七牛用户可以非常方便使用七牛的网络加速系统",
                "直接参与到系统设计和核心代码开发"
            ],
            "requirements": [
                "计算机或相关专业本科以上学历，3 年以上系统软件开发工作经验",
                "精通 C/C++/Go 至少一门语言",
                "有大型复杂系统设计开发经验者优先",
                "有带团队经验、推动协调、项目管理经验者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "10",
            "job_title": "CDN 高级运维工程师 SRE",
            "place": [
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "服务稳定性问题追查、定位和优化，追求极致的性能，提升七牛 CDN 平台稳定性",
                "制定和优化运维解决方案，包括但不限于柔性容灾、智能调度、弹性扩容与防攻击",
                "主导业务架构的可运维性设计，参与业务系统的设计与实施",
                "设计与开发高效的自动化运维系统，使用代码解决线上问题，提升运维工作效率",
                "建设七牛自有 CDN 分发网络，机房选点建设，集群方案设计，日志流量调度，服务稳定性保证"
            ],
            "requirements": [
                "3 年以上运维开发经验，对立体监控、自动部署、容量管理、自动容灾有较深入的理解和实践经验",
                "快速定位和分析客户所遇问题，快速提供最佳解决方案",
                "实际运维工作经验，精通 Linux 操作系统、TCP/IP 等常用协议，熟悉CDN & DNS 基本原理",
                "熟练掌握 C/PHP/Python/Shell 至少 1 至 2 种语言，并有相关运维开发经验"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "11",
            "job_title": "CDN 调度系统研发工程师",
            "place": [
                "北京"
            ],
            "time": "2016/11/10",
            "duty": [
                "设计、实现、优化七牛融合/自有 CDN 的各调度系统",
                "设计、实现七牛各 DNS 系统的开发与设计",
                "通过技术手段，进一步提升七牛 CDN 服务稳定性与性能",
                "直接参与到系统设计和核心代码开发"
            ],
            "requirements": [
                "有 Linux 系统开发经验，熟悉 C/C++/Go 等一种开发语言",
                "熟悉 TCP/IP 协议，熟悉 HTTP 协议",
                "熟悉 CDN 原理和技术，熟悉 CDN 调度系统工作原理",
                "具有良好的沟通能力，有较强的独立工作能力和解决问题的能力",
                "有 CDN 调度系统的研发、调优经验者优先",
                "有 IP 库系统、DNS 牵引系统经验者优先",
                "具有深厚算法及数据结构知识优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "12",
            "job_title": "运营业务研发工程师 ",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "理解并分析业务需求，设计并编码实现满足业务功能的程序"
            ],
            "requirements": [
                "一年以上 Web 开发经验",
                "精通和熟悉主流语言的至少一门：Python/Ruby/Go/PHP 等",
                "熟悉 Linux 工作环境，熟悉 MySQL/PostgreSQL/MongoDB 至少一种数据库编程",
                "熟悉 HTTP 协议，了解微服务接口的设计方法",
                "工作积极主动、擅于思考并主动沟通解决业务方面的问题",
                "有一定的英文文档阅读能力",
                "有运营管理类或数据分析类项目开发经验者优先",
                "熟悉 Go/Ruby 语言优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "13",
            "job_title": "高级前端开发工程师（运营研发)",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "配合产品经理和设计师快速实现一流的前端界面，优化代码并保持良好兼容性",
                "持续改进当前产品的前端功能，优化性能，改善访问体验",
                "主导前端框架的设计和开发"
            ],
            "requirements": [
                "熟悉 HTTP 协议、W3C 标准，熟悉页面架构和布局，能书写兼容主流浏览器的样式",
                "掌握 HTML/HTML5， CSS/CSS3, 代码结构清晰可读，易于维护",
                "熟练使用常见的 JavaScript 类库，如 jQuery Bootstrap 等",
                "熟悉主流 JavaScript 框架，如 React AngularJS Vue.js Backbone.js（熟悉 Angular 者优先）",
                "熟悉前端自动化构建流程，如 Grunt Gulp Webpack",
                "熟悉 JavaScript 设计模式，能以模块化进行开发",
                "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物",
                "三年以上实际项目中的前端开发经验"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "14",
            "job_title": "运营工程师（用户体验部）",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "建立 BUX 产品运营体系",
                "参与用户的使用场景定义，并提出解决方案",
                "进行日常数据校验、初始化及修复",
                "分析数据，并根据数据生成报告"
            ],
            "requirements": [
                "熟悉 TCP/HTTP 协议,一年以上 Web 开发经验,至少熟悉一门服务端语言",
                "能够了解和消化用户需求,拥有良好的沟通能力以及分析问题和解决问题的能力",
                "BUX 团队介绍：Qiniu Business User Experience，是七牛面向客户进行全方位服务的平台团队，在这个团队中，关注数据带来的服务体验影响， 以此驱动各部门的运营，改善关注技术驱动带来的效率影响， 使对内的服务效率更高， 对外的服务更聪明，关注信息的高速流通带来的团队影响效率， 使客户发生的任何细小的问题及时的传达到团队的角落。无论你是数据、 工程、 服务、 运营等特质的角色， 欢迎加入团队。"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "15",
            "job_title": "公有云存储运营经理",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "主导公有云存储的运营工作，配合研发与销售，提高产品的销量",
                "发掘各行业客户的存储量变化趋势与特征，评估增量潜力与影响因素，拟定销售策略，推动商务经理与售前工程师跟进拉升存储量",
                "关注各行业存储需求演化趋势，分析评估需求可行性、重要性与优先度，配合产品经理推动相关功能研发落地",
                "定期撰写存储运营报告，与存储产品团队共同研判发展方向，阶段性调整发展策略"
            ],
            "requirements": [
                "具备系统性观察分析存储产品的能力",
                "具备宽广的行业视野与业务知识",
                "具备基本的运营数字分析能力，熟练使用各类运营分析工具",
                "有云存储/公有云行业从业经验 2 年以上者优先",
                "沟通能力优异者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "16",
            "job_title": "后端开发工程师（企业服务） ",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "参与大型应用平台的后端开发"
            ],
            "requirements": [
                "参与过大型复杂项目，对复杂系统的快速拆解、理解能力",
                "编译型语言（例 C++, Java）背景，玩过或者有 Golang，Python 经验者优先，Bash 编程经验",
                "Linux 服务端开发、调试经验，熟悉网络编程、TCP、HTTP",
                "有云服务技术支持经验者优先对编程、技术有热情，态度积极"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "17",
            "job_title": "高级解决方案工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "与客户进行需求沟通，沉浸入客户业务场景，为客户梳理、明确乃至引导偏转业务需求",
                "深入理解我司存储和多媒体处理技术架构的适用场景，为用户提供正式的 方案演示/规划实施/技术承诺文档",
                "深入理解项目需求和竞争对手优劣势，对客户进行现场方案宣讲和技术对比工作",
                "全权负责项目招投标中的技术方案相关工作，在项目签约后做实施好日常运维流程推进工作",
                "和内部开发同事顺畅沟通，评估客户定制化需求的技术可行性，并最终付诸实施"
            ],
            "requirements": [
                "硬性要求：计算机行业从业五年以上，有 售前/运维/存储/数据库 任意一种高级工程师的两年以上工作经历",
                "硬性要求：熟练使用 Office 和 Wiki，具有良好方案撰写能力，具有技术标书和合同谈判经验",
                "强悍的执行力和项目推进能力，能自我驱动去明确目标、搜集资源、推进工作、汇报进度、申请验收",
                " 良好的人际交往与沟通能力，良好的环境和需求分析能力，能够引导客户需求和协调内部资源共同推进项目",
                "有云计算项目实施经验者优先，业内知名博主优先，能在简历内附带不涉密样例文档者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "18",
            "job_title": "服务端技术支持工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "代表公司接入并服务客户",
                "参与改善公司客户服务流程，参与开发客户服务内部系统",
                "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
                "根据客户需求，帮助公司改善产品甚至探讨方向、策略"
            ],
            "requirements": [
                "本科及以上学历、计算机相关专业、基础扎实",
                "熟悉 TCP/HTTP 协议，熟悉 CDN & DNS 基本原理",
                "1 年以上研发经验，服务端研发优先。精通和熟悉主流语言的至少一门：C/C++/Java/Python/Go/Ruby/Erlang 等",
                "热爱分享，较好的文档写作能力",
                "有云服务技术支持经验者优先"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        },
        {
            "id": "19",
            "job_title": "iOS 技术支持工程师",
            "place": [
                "上海"
            ],
            "time": "2016/11/10",
            "duty": [
                "代表公司接入并服务客户",
                "参与改善公司客户服务流程，参与开发客户服务内部系统",
                "负责公司产品 iOS 语言 SDK 的客户支持服务"
            ],
            "requirements": [
                "熟练掌握 Objective-C 有 Swift 经验者优先",
                "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
                "对流媒体开发有一定了解",
                "热爱分享，较好的文档写作能力"
            ],
            "pro": [
                "hr@qiniu.com"
            ]
        }
    ],
    "business": [],
    "product": [],
    "design": [],
    "marketing": [{
        "id": "0",
        "job_title": "高级销售经理",
        "place": [
            "上海",
            "广州"
        ],
        "time": "2016/11/10",
        "duty": [
            "从事云存储、融合 CDN 产品的销售工作，达成销售指标，扩大产品的市场占有率",
            "根据公司市场战略，开拓新市场和新客户，维护客户关系，扩大公司业务量",
            "收集各种有关市场销售信息，及时反馈客户资源信息，提出有效的市场运作及销售建议",
            "为不同类型的商业客户提供技术解决方案",
            "准备客户的销售计划、技术交流、Demo、建议书",
            "完成公司分配的销售业绩目标"
        ],
        "requirements": [
            "计算机或相关专业专科以上学历",
            "掌握完善的销售技巧，具备优秀的与客户沟通能力，思维敏捷",
            "两年以上 IT 行业销售工作经验，良好的互联网站客户基础",
            "有 IT 行业售前工程师或技术支持工程师工作经验",
            "有 CDN、云服务技术或销售经验者优先考虑",
            "擅长与人交流合作，具有团队精神",
            "工作中具有较强的主动性、积极性与创造性"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "1",
        "job_title": "大客户经理",
        "place": [
            "上海",
            "北京",
            "深圳",
            "广州"
        ],
        "time": "2016/9/1",
        "duty": [
            "挖掘公司云存储服务在各行业尤其是移动互联网行业的销售机会",
            "清楚描述潜在客户在数据存储、CDN 加速等领域的需求",
            "组织协调公司技术资源满足客户的解决方案需求",
            "负责大客户的合同签署，收款跟进和关系维护，形成持续的合作"
        ],
        "requirements": [
            "3 年以上移动互联网、CDN、云计算基础硬件设施等行业的销售或市场经验",
            "热爱各种社交产品微博、微信等各种移动互联创新产品和工具",
            "了解国内外主流云平台服务商 例如 AWS、阿里云、百度云等产品",
            "具有很强的逻辑思维和分析能力，善于分析各种竞合关系",
            "有在存储类产品、CDN 行业售前或销售经验、计算机或信息技术相关专业的优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "2",
        "job_title": "商业拓展专员－BD",
        "place": [
            "上海"
        ],
        "time": "2016/11/10",
        "duty": [
            "挖掘线上注册客户的需求，转化成有效商业机会",
            "根据市场部提供的活动名单或者销售提供的潜在客户名单，陌生电话沟通，挖掘需求，转化成商业机会"
        ],
        "requirements": [
            "大专及以上学历",
            "专业不限，学习能力和理解能力好，最好有电话沟通的相关经验，心理素质好"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "3",
        "job_title": "客服经理",
        "place": [
            "上海"
        ],
        "time": "2016/11/10",
        "duty": [
            "挖掘线上注册客户的需求，转化成有效商业机会",
            "根据市场部提供的活动名单或者销售提供的潜在客户名单，陌生电话沟通，挖掘需求，转化成商业机会",
            "管理客服人员,配合销售部工作的进行"
        ],
        "requirements": [
            "大专以上学历，专业不限，良好的心理素质，学习能力和理解能力好，有电话沟通的相关经验"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "4",
        "job_title": "售前技术支持工程师",
        "place": [
            "深圳",
        ],
        "time": "2016/11/10",
        "duty": [
            "负责客户现场技术支持，可以根据手册和指导进行系统安装和升级",
            "负责收集客户使用过程中的问题和需求点"
        ],
        "requirements": [
            "能够理解层级系统的框架和依赖关系",
            "可以理解客户业务依赖",
            "可以和客户进行流程的沟通",
            "熟悉 Redhat Linux 系统，熟悉常用命令，Shell 或 Python 编程",
            "对 HTTP 协议对象存储有所了解，了解 S3、七牛等对象存储系统的使用",
            "有 IDC 运维经验和分布式运维实施经验者优先",
            "了解开源系统和框架：NGINX、OpenStack、Zabbix、Prometheus 者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "5",
        "job_title": "采购专员",
        "place": [
            "上海",
        ],
        "time": "2016/11/10",
        "duty": [
            "负责公司业务发展所需要的服务器、IDC、CDN 等资源的采购",
            "负责供应商的开发、维护、优化和调整工作，负责合同签订及供应商的管理和服务工作。通过考核手段优化供应商管理",
            "协调以及管理业务部门对资源的需求，满足业务部门不断发展的资源需求",
            "编制采购预算，实施预防和过程控制，有效降低成本；审核、签订采购合同，制定合同谈判的战术和规范"
        ],
        "requirements": [
            "本科以上学历，1 年以上采购经验，有大型互联网公司或 IDC、CDN、云服务商采购工作背景的优先考虑",
            "具有较强沟通能力和责任心，具备优秀的合同谈判和签约能力",
            "成本意识强，良好的管控能力，较强的数据分析能力和供应商资源整合能力",
            "品德优良、忠实可靠、责任心强，具有较强韧性"
        ],
        "pro": ["hr@qiniu.com"]
    }],
    "function": []
};