var jobInfo={
    "tech": [
        {
            "id": "0",
            "job_title": "前端开发工程师",
            "place": [
                "北京"
            ],
            "time": "2016/8/31",
            "duty": [
                "配合后端工程师快速高质量地完成项目前端工作"
            ],
            "requirements": [
                "熟悉 HTML、CSS，熟悉页面结构和布局，对 Web 标准和标签语义化有深入理解",
                "熟悉 JavaScript，熟悉使用常见的 JavaScript 类库",
                "了解 W3C/HTTP",
                "有 Flex/ActionScript 开发经验者优先",
                "有可以实际展示的前端项目或作品",
                "良好的团队协作及沟通能力",
                "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物"
            ],
            "pro": []
        },
        {
            "id": "1",
            "job_title": "数据分析开发工程师",
            "place": [
                "上海"
            ],
            "time": "2016/8/31",
            "duty": [
                "独立完成模块的开发、维护和优化，协助完成系统集成",
                "负责海量日志分析系统的设计，架构与开发工作"
            ],
            "requirements": [
                "两年以上服务端工作经验",
                "精通和熟悉至少以下主流语言中的1 门：C/C++/Java/Python/Go/Erlang/Scala等，熟悉Java/Scala语言的优先",
                "掌握 HTML/HTML5，CSS/CSS3, 代码结构清晰可读，易于维护",
                "熟悉Linux工作环境，熟悉至少一种数据库编程",
                "拥有海量数据处理和并行计算开发以上经验优先",
                "有过hadoop、storm、spark、kafka、flume经验的优先",
                "积极主动，具备团队意识，具有高度的责任心"
            ],
            "pro": []
        },
        {
            "id": "2",
            "job_title": "CDN调度系统研发工程师",
            "place": [
                "杭州"
            ],
            "time": "2016/8/31",
            "duty": [
                "设计、实现、优化七牛融合/自有CDN的各调度系统",
                "设计、实现七牛各DNS系统的开发与设计",
                "通过技术手段，进一步提升七牛CDN服务稳定性与性能",
                "直接参与到系统设计和核心代码开发"
            ],
            "requirements": [
                "有linux系统开发经验，熟悉C/C++/Go等一种开发语言",
                "熟悉TCP/IP协议，熟悉HTTP/DNS协议",
                "熟悉CDN原理和技术，熟悉CDN调度系统工作原理",
                "具有良好的沟通能力，有较强的独立工作能力和解决问题的能力",
                "有CDN调度系统的研发、调优经验者优先",
                "有IP库系统、DNS牵引系统经验者优先",
                "具有深厚算法及数据结构知识优先"
            ],
            "pro": []
        },
        {
            "id": "3",
            "job_title": "CDN监控系统研发工程师",
            "place": [
                "上海"
            ],
            "time": "2016/8/31",
            "duty": [
                "负责七牛CDN监控、监测、探测系统的设计与开发工作"
            ],
            "requirements": [
                "具备Hacker精神",
                "熟悉C/C++/Go至少一门编程语言",
                "熟悉TCP/IP协议簇，有较丰富的网络编程经验",
                "熟悉CDN监控系统或调度系统者优先",
                "有大型互联网后端服务器系统设计开发经验者优先"
            ],
            "pro": []
        },
        {
            "id": "4",
            "job_title": "CDN缓存系统开发工程师",
            "place": [
                "上海",
                "杭州",
                "北京"
            ],
            "time": "2016/9/1",
            "duty": [
                "参与七牛融合/自建缓存组件的开发和优化",
                "开发七牛CDN静态内容、下载、点播等系统",
                "研究和完善ATS的核心模块，开发ATS的业务插件，修复ATS可能出现的Bug",
                "完善openResty相关核心功能，研究和引进社区的先进功能到生产环境",
                "开发缓存系统的刷新、预取、验证等组件，优化其性能与效率",
                "开发WAF模块"
            ],
            "requirements": [
                "有Linux系统开发经验，熟悉C/C++/Go等一种开发语言",
                "熟悉TCP/IP协议，熟悉HTTP协议",
                "熟悉开源HTTP/Cache服务器（如TrafficServer、Squid、Varnish、Nginx、Lighttpd等），有分析其代码实现或模块编写经验者优先",
                "熟悉OpenResty/Nginx+Lua开发优先； 5）有点播系统开发经验者优先",
                "有点播系统开发经验者优先",
                "熟悉常用消息队列（ZeroMQ、RabbitMQ、Kafka等）、常用RPC组件（ProtoBuf，Thrift等）者优先",
                "熟悉高并发，高性能服务器相关核心技术优先",
                "开源爱好者，Github有知名项目者优先；"
            ],
            "pro": []
        },
        {
            "id": "5",
            "job_title": "虚拟化 (KVM/Nova) 研发工程师",
            "place": [
                "上海",
                "北京"
            ],
            "time": "2016/8/31",
            "duty": [
                "负责 IAAS 虚拟化技术研发与应用"
            ],
            "requirements": [
                "熟悉 Linux/Unix 操作系统及性能调优",
                "熟悉 Linux/Unix 虚拟化技术开发，如 libvirt/qemu/kvm 等",
                "熟悉 TCP/IP 协议及 Linux/Unix 网络编程",
                "熟悉 Linux/Unix 环境下 debug/trace 相关技术",
                "熟悉 OpenStack Nova 架构设计与开发",
                "有良好的学习能力和良好的团队协作能力"
            ],
            "pro": []
        },
        {
            "id": "6",
            "job_title": "实施工程师",
            "place": [
                "上海"
            ],
            "time": "2016/9/1",
            "duty": [
                "负责业务应用系统的审核、部署、发布、监控、维护和优化",
                "负责突发事件管理，问题跟踪与管理，保障系统 24×7 稳定运行",
                "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
                "协调开发部门，配置管理，基础运维，更好提供服务"
            ],
            "requirements": [
                "本科及以上学历，计算机相关专业，基础扎实",
                "对分布式集群、架构、开源技术有火一样的热情",
                "深入理解 Linux 操作系统、体系结构",
                "至少精通一门开发语言，如C/Python/Shell/Perl等",
                "有良好的编程基础和 Debug 能力，熟悉网络知识及典型协议原理"
            ],
            "pro": []
        },
        {
            "id": "7",
            "job_title": "技术支持工程师",
            "place": [
                "上海"
            ],
            "time": "2016/9/1",
            "duty": [
                "代表公司接入并服务客户",
                "参与改善公司客户服务流程，参与开发客户服务内部系统",
                "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
                "根据客户需求，帮助公司改善产品甚至探讨方向、策略"
            ],
            "requirements": [
                "本科及以上学历、计算机相关专业、基础扎实",
                "熟悉 TCP/HTTP 协议，熟悉 CDN & DNS 基本原理",
                "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
                "热爱分享，较好的文档写作能力",
                "对互联网市场敏锐，能够深刻理解、消化并满足市场、客户需求",
                "自信，擅表达，喜欢演讲，敢于用正确的逻辑、温柔的言语去挑战权威"
            ],
            "pro": []
        }
    ],
    "business": [],
    "product": [],
    "design": [],
    "marketing": [
        {
            "id": "0",
            "job_title": "销售管培生",
            "place": [
                "上海",
                "北京",
                "深圳",
                "广州",
                "杭州"
            ],
            "time": "2016/9/1",
            "duty": [
                "协助大客户经理建立销售计划和各种业务拓张",
                "挖掘公司目标客户，进行日常客户沟通联络和业务拓展",
                "进行客户关系的管理，整理、维护和分析客户资料",
                "完成公司指定的销售指标"
            ],
            "requirements": [
                "本科以上学历，计算机等技术相关专业优先",
                "沟通能力强，乐于和善于表达",
                "热爱销售，有良好的抗压能力",
                "自信、乐观向上、工作态度积极、具有团队合作精神",
                "乐于接受新鲜事物，学习能力强"
            ],
            "pro": [
                "专注设计细节，对细节把控有狂热的追求；",
                "对 Typography 有所了解；",
                "是 Dribbble Player。"
            ]
        },
        {
            "id": "1",
            "job_title": "售前咨询工程师",
            "place": [
                "北京",
                "上海"
            ],
            "time": "2016/9/1",
            "duty": [
                "随同商务人员拜访客户，进行价值陈述，梳理客户技术需求及痛点，促成测试意向",
                "撰写项目解决方案，协调公司内部资源进行重大项目支撑",
                "协助客户对接和测试各项云服务，并引导客户调整技术架构",
                "观察云行业业态，持续分析业务发展趋势，撰写行业解决方案",
                "参与 IT 会议，宣传七牛理念、服务与解决方案"
            ],
            "requirements": [
                "具备扎实的计算机理论知识和优秀的编程思路，计算机科学与技术、网络工程，通信工程等相关专业大学本科以上学历",
                "优秀的沟通表达能力，具备独立思考能力，有较好的客户服务意识，有较强的抗压能力",
                "热爱销售，有良好的抗压能力熟练使用 office，能够进行技术方案的编写",
                "精通 DNS 原理，熟悉 Nginx，ATS，Squid 等代理软件",
                "熟悉 openstack，spark，docker 等开源技术，有云存储，云计算，云直播，CDN 等相关行业经验优先"
            ],
            "pro": []
        }
    ],
    "function": []
};
