var jobInfo = {
    "tech": [{
        "job_title": "资深图片算法开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责图片算法的改进、优化"
        ],
        "requirements": [
            "熟悉 C 语言，扎实的 C 语言基础",
            "熟悉一门脚本语言，比如 Python、Bash 等",
            "熟悉 Linux 操作系统，对多线程、并发编程有深入了解",
            "对常见的图片格式，比如 JPEG、PNG、WebP 有所了解，能根据需要改进算法",
            "对 ImageMagick、GraphMagic 等图片算法开源库有一定了解，能根据需要调试、优化、改进算法",
            "良好沟通能力，对编程、技术有热情，态度积极",
            "熟悉图片处理的常见算法，并能将之工程化",
            "有 GPU 算法经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "P2P 资深技术专家",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责大型 P2SP 服务的服务端、客户端的架构和开发"
        ],
        "requirements": [
            "熟悉 BitTorrent 协议，有完整 P2P 或 P2SP 项目的架构设计、开发优化、运营调优经验",
            "熟悉 HTTP、TCP/IP、UDP 协议，精通网络编程、多进程、多线程编程",
            "有 C/C++ 开发经验，熟悉 STL, boost 等常用类库；",
            "对多媒体网络协议(HLS，RTMP，RTSP)，封装格式(MP4、FLV)，编解码格式(H.264，AAC)等流媒体知识有一定认识",
            "对 WebRTC 协议有一定了解、熟悉 GoLang 语言者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "资深视频、流媒体开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责视频点播、流媒体业务开发"
        ],
        "requirements": [
            "熟悉各种视频文件格式(MP4，FLV，TS)，流媒体协议(HLS，DASH)",
            "对于 FFmpeg 项目有一定的了解，有使用 FFmpeg 库的经验",
            "扎实的 C,C++ 语言基础",
            "有一定的 OpenGL ES 开发经验",
            "对 DRM 有一定的了解",
            "具有团队精神与敬业精神，学习钻研能力强，有上进心，具有良好的协调沟通能力",
            "对视频编码的概念，流程了解，尤其是 H264 和 H265",
            "对 AAC，MP3 音频编码了解"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "数据处理 & 分析开发工程师 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "直播 SDK & 流媒体服务器日志收集",
            "日志数据的实时计算处理和离线计算处理",
            "依托于质量数据做直播产品的质量运营和线路调优，能够反映七牛直播云的网络拓普质量，体现数据价值",
            "通过机器学习能够做到实时或者预测线路质量，实现最终自动化运营的目标"
        ],
        "requirements": [
            "具备流式日志数据的收集知识，对于离线&实时日志数据的存储和计算有一定经验",
            "了解 Flume，Kafka，Spark&Storm，Hadoop，Hive 等技术",
            "对于数据挖掘和运营分析有一定经验",
            "最好具备可视化 MVC 系统的开发知识，掌握 Go，Java，Python 等其中至少一门开发语言",
            "有 CDN 调度系统的研发、调优经验者优先",
            "了解一定 HTML，CSS，JS 等前端知识",
            "最好具备一定机器学习的背景"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "测试开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "设计、开发、执行及维护自动化测试",
            "测试环境自动化发布及管理维护",
            "参与需求讨论和跟踪，快速理解需求点并分析风险",
            "与开发人员密切配合，推动质量保证流程",
            "对新技术具有很强的好奇心，能够快速将新想法融入解决方案"
        ],
        "requirements": [
            "2 年以上的测试或者开发经验",
            "熟悉软件测试理论和软件测试流程",
            "具备较强的逻辑思维及分析能力，熟练掌握测试用例设计",
            "精通和熟悉至少以下主流语言中的 1 门：C/C++/Java/Python/Go/Erlang/Scala 等，有 Java 经验者优先",
            "具备高度的责任心，热爱开发及测试工作，具有很强的适应能力",
            "活跃在各个技术社区，较好的文档写作习惯（加分项)"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "测试开发工程师",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "设计、开发、执行及维护自动化测试用例",
            "全面熟悉产品业务，梳理测试用例与端到端场景",
            "测试环境自动化发布及管理维护",
            "参与需求讨论和跟踪，快速理解需求点并分析风险",
            "与开发人员密切配合，推动质量保证流程",
            "对新技术具有很强的好奇心，能够快速将新想法融入解决方案"
        ],
        "requirements": [
            "2 年以上的测试或者开发经验",
            "具备较强的逻辑思维及分析能力，熟练掌握测试用例设计",
            "精通和熟悉至少以下主流语言中的 1 门：C/C++/Java/Python/Go/Erlang/Scala 等，有 Java 经验者优先",
            "具备高度的责任心，热爱开发及测试工作，具有很强的适应能力",
            "活跃在各个技术社区，较好的文档写作习惯（加分项)"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "中高级平台研发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责计算机视觉技术应用于实际产品的软件设计和开发",
            "负责产品架构的改进及性能优化",
            "负责大规模离线数据的处理",
            "负责新技术的学习、研究和应用",
            "参与产品的设计和改进"
        ],
        "requirements": [
            "较强的后台服务设计、研发能力",
            "具有 1 年以上的数据平台架构研发工作经验",
            "熟悉 Linux\\Unix，能进行 Shell 编程",
            "熟悉 C/C++、Python 等开发语言，熟悉面向对象思想，了解常用设计模式",
            "熟悉 Hadoop 等并行计算框架",
            "对数据库的基本理论及其内部实现机制有一定的理解",
            "对新技术敏感，求知欲强，能快速学习并具备较强的技术领悟能力",
            "良好的团队合作能力，良好的沟通能力与口头、书面表达能力，严谨的工作态度与高质量意识，良好的抗压能力",
            "本科以上，全职"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "网络工程师",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责数据中心机房运维及优化，及时排除网络故障，保证网络稳定运行",
            "处理公司业务部门提交的各类网络事务和问题",
            "构建网络平台的运行状态监控"
        ],
        "requirements": [
            "计算机及相关专业本科学历，2 年以上网络技术相关工作经验",
            "良好的沟通表达能力，吃苦耐劳，乐观上进，做事认真，仔细，负责，能够 7x24 响应突发事件",
            "熟悉 TCP/IP 协议，OSPF、ISIS、BGP 等常用路由协议，熟悉常用网络技术如 PBR、ECMP、NAT、VPN、QOS、VRRP、VLAN、ACL、STP 等二三层通信、安全相关技术",
            "熟练掌握常见网络问题的排障技巧，并理解原理；具有较强的实际操作能力、分析能力",
            "熟悉主流厂商的网络设备，如 Cisco、H3C、华为交换机、路由器的基础配置和功能实现，基本的设备软硬件故障定位",
            "有大型网络的规划、设计、运维及优化经验者优先",
            "有熟练 Linux 系统技能和基本的运维开发能力（Python、Shell）者优先",
            "有 CCIE、H3C、华为等高级认证者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "高级运维开发工程师 SRE",
        "place": [
            "北京",
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "保证七牛 CDN 平台稳定性，制定和优化运维解决方案",
            "主导业务架构的可运维性设计，设计与开发高效的自动化运维系统"
        ],
        "requirements": [
            "3 年以上运维开发经验，对立体监控、自动部署、容量管理、自动容灾有较深入的理解和实践",
            "熟练掌握 C/PHP/Python/Shell 等 1~2 种语言，并有相关运维开发经验",
            "快速定位和分析客户所遇问题，快速提供最佳解决方案",
            "有实际的运维工作经验，精通 Linux 操作系统、TCP/IP 常用协议，熟悉 CDN & DNS 基本原理。"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "安全工程师 ",
        "place": [
            "上海",
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责七牛所有业务系统的安全（包括应用安全、主机安全、网络安全）",
            "负责例行安全检查、漏洞跟踪处理、解决方案制定",
            "负责公司的安全应急响应的处理。能够及时响应突发安全事件",
            "负责员工安全意识，安全技术的培训工作",
            "负责最新的安全漏洞研究，最新安全动态的跟踪与探索"
        ],
        "requirements": [
            "2-3 年互联网公司安全工作经验",
            "对常见的安全漏洞 (Web、系统) 的原理、危害、利用方式及解决方案有深入的理解并有丰富的经验。（有独立渗透测试经验或在各漏洞平台上报过漏洞者优先）",
            "具备独立对应用进行黑盒、白盒安全测试的能力",
            "熟练掌握一门开发语言（如 Java、PHP、Python 等）并可开发简单工具",
            "对移动安全有所了解，熟悉加固、反编译、漏洞挖掘及解决方案等",
            "具有踏实的工作心态、良好的沟通能力和团队协作能力"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "高级运维工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责云平台集群的大规模、高可用和稳定性运维工作",
            "深入研究大数据业务运维相关技术，持续优化服务架构",
            "深入了解业务产品流程和模型，解决业务产品各种异常",
            "深入了解容量规划和集群性能优化",
            "深度参与运维系统的架构设计与实施，主导系统架构可运维设计方案"
        ],
        "requirements": [
            "2-3 年互联网公司安全工作经验",
            "对常见的安全漏洞 (Web、系统) 的原理、危害、利用方式及解决方案有深入的理解并有丰富的经验。（有独立渗透测试经验或在各漏洞平台上报过漏洞者优先）",
            "具备独立对应用进行黑盒、白盒安全测试的能力",
            "熟练掌握一门开发语言（如 Java、PHP、Python 等）并可开发简单工具",
            "对移动安全有所了解，熟悉加固、反编译、漏洞挖掘及解决方案等",
            "具有踏实的工作心态、良好的沟通能力和团队协作能力"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "CDN 后端开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责七牛网络加速相关子系统的架构设计与研发工作",
            "负责流量系统、计费系统、刷新系统、发布系统、质量系统的设计与开发工作",
            "带领团队，通过开发各种网络加速业务系统，让七牛用户可以非常方便使用七牛的网络加速系统",
            "直接参与到系统设计和核心代码开发"
        ],
        "requirements": [
            "计算机或相关专业本科以上学历，3 年以上系统软件开发工作经验",
            "精通 C/C++/Go 至少一门语言",
            "有大型复杂系统设计开发经验者优先",
            "有带团队经验、推动协调、项目管理经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "CDN 运维开发工程师 SRE",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "以线上服务可用性与性能作为运维唯一标准，追求极致的性能与稳定，服务可用性 >99.99%",
            "设计与研发立体化运维平台，不限于智能资产系统、全方位监控系统、分布式发布系统，极大的提高运维效率，保证服务极致稳定",
            "制定和优化运维解决方案，包括但不限于柔性容灾、智能调度、弹性扩容与防攻击",
            "设计与建设自有 CDN 分发网络，机房选点建设，集群方案设计，日志流量调度，服务稳定性保证"
        ],
        "requirements": [
            "熟练掌握基础数据结构与算法",
            "3年以上运维开发经验，具有自动化运维平台开发经验",
            "实际运维开发工作经验，精通 Linux 操作系统、TCP/IP、HTTP 等常用协议",
            "熟练掌握 Python/Go/Shell 至少 1-2 种语言，并有相关复杂系统开发经验"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "资深 CDN 运维负责人",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "带领团队运维运营七牛融合 CDN 平台，降低成本优化服务质量",
            "负责七牛 CDN 全球节点的建设与运维工作，打造业界领先的 CDN 加速网络",
            "参与七牛 CDN 自动化运维系统的设计与开发工作，提升团队运维效率"
        ],
        "requirements": [
            "5 年以上工作，3 年以上 CDN 运维经验，有带领团队经验",
            "至少熟练掌握 Shell/Python/Perl/Ruby/Lua 一种脚本语言",
            "掌握负载均衡、内容缓存相关算法，熟悉 CDN 服务器硬件配置",
            "具有良好的沟通能力，有较强的独立工作能力和解决问题的能力",
            "有 NGINX、Squid、Varnish、TrafficServer 等运维经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "CDN 产品经理 ",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "理解 CDN 产品的业务逻辑和实现原理",
            "归纳和整理功能需求，以满足 CDN 运营与运维",
            "设计产品界面原型，并定义内部和外部接口",
            "与相关人员讨论并生成产品设计文档",
            "进行产品功能的初步验收，协助管理团队研发进度",
            "辅助完成资源协调，跨部门沟通，远程协作等事项"
        ],
        "requirements": [
            "具备对复杂业务的理解能力，以及清晰的设计思维与逻辑",
            "具备复杂系统的模块设计，业务逻辑设计的能力",
            "具备一定的相关技术能力，涉及网络，协议，运营商，机房，域名，调度等",
            "具备一定原型设计能力，可以熟练使用原型设计工具",
            "具备不错的文档能力",
            "具备良好的表达能力和沟通能力",
            "熟悉 CDN 相关技术原理和原理者，有相关行业经验经历者优先",
            "从事过相关的产品设计，技术研发，测试，售前等岗位者优先",
            "有远程协作的经历者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "Golang 开发工程师",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责 CDN 分发网络中调度、缓存、监控等核心系统的设计和研发；",
            "负责上传加速网络的设计与研发",
            "负责网络加速中一些新技术的设计与研发"
        ],
        "requirements": [
            "有 Hacker 精神",
            "非常熟悉 C/C++/Go 至少一门编程语言",
            "熟悉 TCP/IP 协议簇，有较丰富的网络编程经验；或熟悉缓存/存储系统",
            "有 CDN 经验者优先",
            "有大型互联网后端服务器系统设计开发经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "公有云存储运营经理",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "主导公有云存储的运营工作，配合研发与销售，提高产品的销量",
            "发掘各行业客户的存储量变化趋势与特征，评估增量潜力与影响因素，拟定销售策略，推动商务经理与售前工程师跟进拉升存储量",
            "关注各行业存储需求演化趋势，分析评估需求可行性、重要性与优先度，配合产品经理推动相关功能研发落地",
            "定期撰写存储运营报告，与存储产品团队共同研判发展方向，阶段性调整发展策略"
        ],
        "requirements": [
            "具备系统性观察分析存储产品的能力",
            "具备宽广的行业视野与业务知识",
            "具备基本的运营数字分析能力，熟练使用各类运营分析工具",
            "有云存储/公有云行业从业经验 2 年以上者优先",
            "沟通能力优异者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "Web 后端开发工程师 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "在架构师的协助下，高质量地完成模块的开发",
            "为模块编写单元测试",
            "协助定位并修复线上问题"
        ],
        "requirements": [
            "一年以上 Web 开发经验",
            "精通和熟悉主流语言的至少一门：Python/Ruby/Go/PHP/Erlang 等",
            "熟悉 Linux 工作环境，熟悉 MySQL/PostgreSQL/MongoDB 至少一种数据库编程",
            "熟悉 HTTP 协议",
            "工作积极主动、擅于思考问题，能够主动沟通与解决问题",
            "有一定的英文文档阅读能力",
            "熟悉 Go/Ruby 语言优先",
            "参与过开源项目的优先",
            "有 Salesforce 和销售相关运营项目研发经验的优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "存储运维工程师 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责公司存储产品的群集搭建/交付/运维/监控/故障处理工作",
            "对交付服务的稳定性，可用性和速度负责，通过各种技术方法，管理手段达到目标",
            "负责向客户交付明确的环境说明文档和技术操作规范，配合商务人员完成交付验收和故障解释工作",
            "对存储系统进行科学的容量规划,可以支持客户侧高速发展的业务需求",
            "可以团队配合应对突发故障的紧急响应和处理工作，能够适应必要情况下的出差任务和应急加班"
        ],
        "requirements": [
            "有 3 年以上运维工程师相关工作经验Linux平台运维管理经验丰富",
            "熟悉主流的 Linux 系统如 CentOS/RHEL LVS Cluster及 Debian/Ubuntu Server 的配置与管理(不少于 2 种)",
            "了解常规网络设备及通用协议，交换机，软硬件防火墙等",
            "熟悉 NGINX、MongoDB、RabbitMQ 等服务的原理和配置，并能解析日志并排除常见故障",
            "熟悉 Iptables, VLAN, Rsync, OpenVPN 等技术",
            "较强的 Shell 脚本编写能力，或至少会使用 PHP/Perl/Python 中的一种进行编程",
            "对 IDS/IPS,缓存，安全和防范非法入侵攻击有一定的经验",
            "有强烈责任心和学习能力,有公司级别优秀员工及优秀项目奖励者优先",
            "有大型网站或服务器集群维护经验( 2000 万 PV 以上，100 台服务器以上)者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "运维开发工程师 ",
        "place": [
            "上海",
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责设计/研发/运维私有云平台",
            "负责设计/研发自动化，可视化运维平台"
        ],
        "requirements": [
            "强烈责任感、严密逻辑思维和主动跨团队沟通能力,并且需要有项目管理及推动力",
            "熟悉各类编程工具 Shell/Go/Python/Perl/Java 等，研发能力强",
            "深入理解 Linux 操作系统、体系结构",
            "具有 Kvm/Docker 或 Kubernetes 等虚拟机或容器及编排管理工具使用和运维经验者",
            "本科或以上学历，计算机相关专业者优先，3 年以上工作经验"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "高级运维开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责设计/研发/运维私有云平台",
            "负责设计/研发自动化，可视化运维平台"
        ],
        "requirements": [
            "强烈责任感、严密逻辑思维和主动跨团队沟通能力,并且需要有项目管理及推动力",
            "熟悉各类编程工具 Shell/Go/Python/Perl/Java 等，研发能力强",
            "深入理解 Linux 操作系统、体系结构",
            "具有Kvm/Docker或Kubernetes等虚拟机或容器及编排管理工具使用和运维经验者",
            "本科或以上学历，计算机相关专业者优先，3年以上工作经验"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "高级解决方案工程师",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "与客户进行需求沟通，沉浸入客户业务场景，为客户梳理、明确乃至引导偏转业务需求",
            "深入理解我司存储和多媒体处理技术架构的适用场景，为用户提供正式的 方案演示/规划实施/技术承诺文档",
            "深入理解项目需求和竞争对手优劣势，对客户进行现场方案宣讲和技术对比工作",
            "全权负责项目招投标中的技术方案相关工作，在项目签约后做实施好日常运维流程推进工作",
            "和内部开发同事顺畅沟通，评估客户定制化需求的技术可行性，并最终付诸实施"
        ],
        "requirements": [
            "硬性要求：计算机行业从业 5 年以上，有 售前/运维/存储/数据库 任意一种高级工程师的 2 年以上工作经历",
            "硬性要求：熟练使用 Office 和 Wiki，具有良好方案撰写能力，具有技术标书和合同谈判经验",
            "强悍的执行力和项目推进能力，能自我驱动去明确目标、搜集资源、推进工作、汇报进度、申请验收",
            "良好的人际交往与沟通能力，良好的环境和需求分析能力，能够引导客户需求和协调内部资源共同推进项目",
            "有云计算项目实施经验者优先，业内知名博主优先，能在简历内附带不涉密样例文档者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "服务端技术支持工程师",
        "place": [
            "北京"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责公司各个产品的技术对接，调优，架构咨询等",
            "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
            "参与改善公司技术服务流程，参与开发客户服务内部系统，工具",
            "根据客户需求，帮助公司改善产品甚至探讨方向、策略"
        ],
        "requirements": [
            "本科及以上学历、计算机相关专业、基础扎实",
            "熟悉 TCP/HTTP 协议，熟悉 CDN & DNS 基本原理",
            "1 年以上研发经验，服务端研发优先。精通和熟悉主流语言的至少一门：C/C++/Java/Python/Go/Ruby/Erlang 等",
            "热爱分享，较好的文档写作能力",
            "有云服务技术支持经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "Web 前端开发工程师（服务线）",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "和后端工程师配合，商定数据接口",
            "和 BI 工程师配合，提供数据可视化支持"
        ],
        "requirements": [
            "2年及以上 WEB 前端工作经验",
            "精通前端基本技术 HTML, CSS, JavaScript",
            "熟悉 CoffeeScript, AngularJS, Gulp",
            "熟悉 Highchart 等前端图形报表插件",
            "基础扎实，有良好的逻辑思维能力，并熟练一到两种后端语言（Golang / Python / PHP / Java / Ruby），拥有良好的代码书写习惯",
            "熟悉 MySQL 、 MongoDB",
            "熟悉 Linux/Unix 系统与开发环境，熟悉 TCP/IP, HTTP 协议并了解 RESTFUL 规范"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "Android多媒体SDK开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "参与 Android 多媒体 SDK 的设计与开发"
        ],
        "requirements": [
            "良好的数据结构和算法基础, 良好的工程素养以及关于 Paper, IETF RFC 与 Open Source 的基本阅读与理解能力",
            "精通 C/C++/Java 编程语言, 熟悉 JNI 机制, 熟悉 NDK 编程, 熟悉汇编",
            "熟悉 Android 多媒体开发, 熟练掌握 Android 基本概念, 并能够灵活利用 Android 提供的机制解决问题",
            "熟练掌握多线程编程, 善于利用各种资源优化代码",
            "熟悉 Android.mk, Makefile 及相关工具链, 以及嵌入式软件架构和调试方法",
            "拥有良好的编码习惯, 热爱多媒体研发工作, 喜欢创新挑战, 自我驱动能力强, 具备良好的沟通能力和团队协作精神"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "Android OpenGL 开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "参与 Android 图像处理算法的研究和开发"
        ],
        "requirements": [
            "良好的数据结构和算法以及数学基础, 良好的工程素养以及关于 Paper, IETF RFC 与 Open Source 的基本阅读与理解能力",
            "精通 C/C++/Java 编程语言, 熟悉 JNI 机制, 熟悉 NDK 编程, 熟悉汇编",
            "熟练掌握 OpenGL ES 绘制方法, 深入理解 OpenGL ES 渲染优化策略, 了解 shader 技术",
            "精通 OpenGL 开发并熟悉 Android GUI 渲染显示机制, 具备在 Android 系统上做过显示系统移植经验优先",
            "熟练掌握多线程编程, 善于利用各种资源优化代码",
            "热爱图形图像技术研发工作, 喜欢创新挑战, 自我驱动能力强, 具备良好的沟通能力和团队协作精神"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "直播实施工程师 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "代表公司配合客户完成直播项目的测试和接入流程",
            "根据客户需求，帮助公司改善产品"
        ],
        "requirements": [
            "至少熟悉一门服务端或者客户端编程语言如 Golang / Python / PHP / Ruby / Java / Objective-C 等",
            "熟悉 TCP / HTTP 协议,熟悉 CDN & DNS 基本原理",
            "快速定位和分析客户所遇问题,快速提供最佳解决方案",
            "良好的心理素质，有担当，热爱生活，永远相信会有更好的解决方案",
            "有直播、秀场产品开发经验的优先",
            "有 iOS 开发经验的优先",
            "有 Android 开发经验的优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "CDN实施工程师 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "代表公司配合客户完成 CDN 的测试和接入流程",
            "根据客户需求，帮助公司改善产品"
        ],
        "requirements": [
            "至少熟悉一门服务端或者客户端编程语言如 Golang / Python / PHP / Ruby / Java / Objective-C 等",
            "熟悉 TCP / HTTP 协议,熟悉 CDN & DNS 基本原理",
            "对互联网市场敏锐,能够深刻理解、消化并满足市场/客户需求",
            "快速定位和分析客户所遇问题,快速提供最佳解决方案",
            "有 CDN 大客户支持经验的优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "iOS 技术支持工程师",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责公司云存储，直播云等产品的技术支持工作，包括产品对接，性能优化，架构咨询",
            "负责公司云存储 iOS SDK 的维护和改进， 直播推流 SDK， 播放 SDK 等对接",
            "参与改善公司技术服务流程，参与开发客户服务内部系统工具"
        ],
        "requirements": [
            "熟练掌握 Objective-C 有 Swift 经验者优先",
            "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
            "对流媒体开发有一定了解",
            "热爱分享，较好的文档写作能力"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "全栈人工智能产品研发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/03/01",
        "duty": [
            "开发七牛人工智能产品的前后端云系统",
            "开发和维护线上人工智能产品的日志和监控系统",
            "评估线上人工智能产品的性能",
            "优化人工智能产品的架构和基础组件"
        ],
        "requirements": [
            "熟悉 Web 后端 Linux 开发技能，计算机基础知识扎实，对数据结构，网络原理，操作系统有较好的掌握",
            "精通 Golang, C/C++， Python 其中的至少一门语言 ",
            "有前端设计和开发经验，Vue.js, Angular.js, React 等框架熟悉者更佳",
            "对数据库系统 Mysql, Mongo 有深入研究的优先",
            "热爱编程，有很好的编程与 Debug 能力, 有很好的团队沟通和产品思维。",
            "Fast Learners more than experts，七牛不关注你的背景，但是你要有快速学习的能力，宽泛的技术视野，创造性思维，富有想象力，有推进人工智能的理想和使命感"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    },{
        "job_title": "后端开发工程师（网络方向）",
        "place": [
            "上海"
        ],
        "time": "2017/03/01",
        "duty": [
            "负责七牛云计算产品的开发工作",
            "直接参与到系统设计和核心代码开发"
        ],
        "requirements": [
            "计算机或相关专业本科以上学历，3 年以上系统软件开发工作经验",
            "精通 C/C++/Go 至少一门语言",
            "有良好的编程风格和编写文档的习惯，有较强的学习能力，能承受一定工作压力",
            "精通 TCP/IP、HTTP 等网络协议，熟练掌握各种工具进行网络问题诊断",
            "有大型分布式系统设计开发经验者优先",
            "有内核模块开发或网络安全开发经验者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    },{
        "job_title": "Linux 内核架构师/开发工程师",
        "place": [
            "上海"
        ],
        "time": "2017/03/01",
        "duty": [
            "负责七牛云计算产品的开发工作",
            "直接参与到系统设计和核心代码开发"
        ],
        "requirements": [
            "计算机或相关专业本科以上学历，3 年以上系统软件开发工作经验",
            "精通 C/C++/Go 至少一门语言",
            "有良好的编程风格和编写文档的习惯，有较强的学习能力，能承受一定工作压力",
            "熟悉 Linux 内核及其开发模式，有内核开发、剪裁、调优经验",
            "精通 Linux 内核一个或以上关键模块（如内存管理、调度、文件系统、驱动）者优先",
            "熟悉 Linux 容器相关技术（namespace、cgroup）者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }],
    "business": [],
    "product": [],
    "design": [],
    "marketing": [{
        "job_title": "高级销售经理",
        "place": [
            "广州"
        ],
        "time": "2017/02/23",
        "duty": [
            "从事云存储、融合 CDN 产品的销售工作，达成销售指标，扩大产品的市场占有率",
            "根据公司市场战略，开拓新市场和新客户，维护客户关系，扩大公司业务量",
            "收集各种有关市场销售信息，及时反馈客户资源信息，提出有效的市场运作及销售建议",
            "为不同类型的商业客户提供技术解决方案",
            "准备客户的销售计划、技术交流、Demo、建议书",
            "完成公司分配的销售业绩目标"
        ],
        "requirements": [
            "计算机或相关专业专科以上学历",
            "掌握完善的销售技巧，具备优秀的与客户沟通能力，思维敏捷",
            "两年以上 IT 行业销售工作经验，良好的互联网站客户基础",
            "有 IT 行业售前工程师或技术支持工程师工作经验",
            "有 CDN、云服务技术或销售经验者优先考虑",
            "擅长与人交流合作，具有团队精神",
            "工作中具有较强的主动性、积极性与创造性"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "大客户经理",
        "place": [
            "上海",
            "北京",
            "深圳",
            "广州"
        ],
        "time": "2016/9/1",
        "duty": [
            "挖掘公司云存储服务在各行业尤其是移动互联网行业的销售机会",
            "清楚描述潜在客户在数据存储、CDN 加速等领域的需求",
            "组织协调公司技术资源满足客户的解决方案需求",
            "负责大客户的合同签署，收款跟进和关系维护，形成持续的合作"
        ],
        "requirements": [
            "3 年以上移动互联网、CDN、云计算基础硬件设施等行业的销售或市场经验",
            "热爱各种社交产品微博、微信等各种移动互联创新产品和工具",
            "了解国内外主流云平台服务商 例如 AWS、阿里云、百度云等产品",
            "具有很强的逻辑思维和分析能力，善于分析各种竞合关系",
            "有在存储类产品、CDN 行业售前或销售经验、计算机或信息技术相关专业的优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "政企行业销售经理 ",
        "place": [
            "北京",
            "上海",
            "深圳"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责运营商政企项目的挖掘、开发和客户关系维护等工作",
            "负责运营商政企合作伙伴的拓展、项目协调、关系维护等工作"
        ],
        "requirements": [
            "具有 3 年以上运营商政企项目经验",
            "具有政府、教育、广电、运营商等行业客户资源",
            "正直，勤奋，积极进取，富有销售狼性精神"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "商业拓展专员 ",
        "place": [
            "上海",
            "成都"
        ],
        "time": "2017/02/23",
        "duty": [
            "挖掘线上注册客户的需求，转化成有效商业机会",
            "根据市场部提供的活动名单或者销售提供的潜在客户名单，陌生电话沟通，挖掘需求，转化成商业机会"
        ],
        "requirements": [
            "大专以上学历，专业不限，良好的心理素质，学习能力和理解能力好，有电话沟通的相关经验"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "售前经理",
        "place": [
            "广州"
        ],
        "time": "2017/02/23",
        "duty": [
            "为行业客户和合作伙伴提供七牛云整体技术平台、业务和技术层面的架构咨询服务，理解客户在研发、运营工作中对 CDN、计算、存储、大数据等服务的需求，分析其快速发展过程中，在基础设施层面所遇到的挑战和未来的方向",
            "负责七牛大广州地区客户（面向电商，游戏，金融，互联网金融, 视频娱乐行业等）的项目的需求分析、方案设计、传统解决方案云化规划设计、应用迁移和数据迁移等设计工作",
            "根据客户业务的需求和理解合作伙伴的需求，基于七牛云的技术架构，输出满足客户需求的服务解决方案",
            "作为七牛云决方案售前技术专家，为企业提供有竞争力的云解决方案, 如规划面向电商，社交娱乐的公有云解决方案，面向运营商，银行某业务场景的专业解决方案，支持业务团队进行售前工作，并配合相关的售中/后等相关业务工作",
            "在客户迁云过程中，根据项目本身的需要，协助研发团队或实施团队（客户\\合作伙伴\\交付经理）完成Demo系统搭建，PoC 测试及最终迁移工作",
            "负责上云案例、技术方案、解决方案竞品分析文档的更新维护"
        ],
        "requirements": [
            "本科以上学历，3年以上的 IT 系统开发，运维，实施工作，1年以上云计算相关的产品使用，架构设计工作经验，互联网工作经验优",
            "了解虚拟化架构及云平台系统的维护管理技术",
            "了解 AWS S3，Openstack Swift，Ceph 等相关存储技术架构优先",
            "了解 CDN 内容分发，域名解析，网络 QoS 知识优先",
            "了解 Hadoop， Spark，等相关大数据组件搭建，使用场景",
            "有一定 IT Infrastructure（包含 IDC，服务器、存储、数据库、网络、中间件）的运维或管理经验",
            "熟悉典型的云服务体系和模式，熟悉业界典型的云架构，KVM 虚拟化技术，Docker 容器技术，虚拟网络技术，分布式存储技术，关系型数据库，如 MySQL\\SQLserver 以及非关系型数据库，如 Redis\\MongoDB",
            "具备优秀的文档能力，清晰明了地表达架构意图，能够熟练编写各类技术文档",
            "良好的沟通、协调及资源整合能力",
            "具备较强的沟通交流能力和高度的团队合作精神，具备较强组织协调能力",
            "极强的问题解决能力，习惯于寻找创新方法来达成目标",
            "学习能力强，抗压能力强，需并行支持多个项目"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "渠道销售经理",
        "place": [
            "成都"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责西南、西北区域渠道市场的开拓及销售工作；",
            "负责建立全面的渠道及大客户销售战略、渠道体系规划与建设，完成各项销售指标/实现公司业绩目标",
            "发展区域的渠道合作伙伴"
        ],
        "requirements": [
            "3 年以上 IT 行业渠道或客户销售经验",
            "有丰富客户资源，有大区市场渠道开拓经验，有成功运作相关销售项目经验者优先 ",
            "了解互联网/云计算/IDC 行业",
            "具有严谨的工作作风、敬业精神、责任感和团队协作精神"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "售前工程师",
        "place": [
            "北京",
            "广州"
        ],
        "time": "2017/02/23",
        "duty": [
            "配合销售跟客户沟通，收集客户业务信息、应用场景信息，整理出有效需求，分解成功能需求列表",
            "将功能需求列表转化为整体解决方案交付给客户，协调其它部门资源，推进实施方案",
            "与客户保持技术与方案上的沟通，及时解答疑问、响应新需求、处理突发故障",
            "协助销售人员提升客户满意度，提升公司整体销售业绩",
            "编写行业解决方案文档，定期维护更新，追随云计算、云存储行业的趋势",
            "推动其它部门实现合理的功能需求，编写使用文档，整合进解决方案中",
            "参与线下 IT 论坛、会议，宣传七牛理念、服务与解决方案"
        ],
        "requirements": [
            "优秀的沟通表达和协调能力，系统的思考能力",
            "云计算、IT 服务领域3年以上售前工程师相关岗位工作经验",
            "能熟悉使用各种办公软件撰写文档和解决方案",
            "计算机科学与技术、信息科学与技术相关专业大学本科以上学历",
            "有 C 语言、C++ 等编程语言一年以上的开发工作经验优先",
            "熟悉移动互联网创业或者自己有创业经历的优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }],
    "function": [{
        "job_title": "校园招聘主管",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责校园招聘项目的整体规划与执行",
            "结合公司及业务部门发展需要，参与规划年度校招计划",
            "组织公司在全国范围内重点院校的校企合作项目，建立并维持良好的校企关系",
            "拓展并维护各类招聘渠道，尤其是校园招聘渠道及新兴渠道",
            "负责招聘微信公众号的推广和运营",
            "建设雇主品牌，包括对外品牌宣传及对内文化落地"
        ],
        "requirements": [
            "全日制本科及以上学历，3 年以上人力资源工作经验，有丰富的校园招聘及项目运营经历",
            "对数据较敏感，通过持续的数据分析优化校招项目",
            "善于多方沟通，挖掘需求，与各团队达成良好的合作",
            "较强的项目推动能力，能够协调各方人力物力资源，推动校招项目的开展",
            "拥有较强的校园人脉及稳定的校园渠道者优先",
            "有创新意识，善于品牌运营，有较强的市场及品牌管理意识者优先"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "行政经理 ",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "参与公司行政管理制度、完善和细化办公管理体系和业务流程",
            "负责公司各类活动组织策划工作",
            "参与制订公司年度行政费用预算制定和月度实施",
            "组织开展各项企业文化活动，企业文化宣传建设工作，营造和谐、愉快的工作环境",
            "协助其他部门完成其他行政事务管理"
        ],
        "requirements": [
            "大学本科及以上学历，行政管理、企业管理、人力资源管理等相关专业",
            "8 年以上工作经验",
            "具备基本的办公软件使用能力、网络基本应用能力，熟知行政管理等方面的知识，具备一定法律、财会知识",
            "具备极强的判断与决策能力、沟通能力、公关能力、计划执行能力、组织协调能力、领导能力、影响力"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }, {
        "job_title": "前台兼行政助理",
        "place": [
            "上海"
        ],
        "time": "2017/02/23",
        "duty": [
            "负责前台总机接听、转接、信件包裹的收发",
            "接待来访人员",
            "负责各类办公文档的编辑、整理、存档、打印复印等工作",
            "办公用品的采购、登记、发放",
            "负责公司商务出差机票、酒店的预订",
            "与各部门保持良好的沟通，及时反馈信息",
            "完成上级主管交待的其它工作"
        ],
        "requirements": [
            "大专及以上学历，应届毕业生亦可",
            "形象气质佳，相貌端正，普通话标准",
            "熟练使用 Office 办公软件，熟练使用操作办公自动化设备",
            "工作态度积极主动，细致耐心，有责任感，具有良好的沟通交流、组织协调能力",
            "思维敏捷，应变能力强；有良好的服务意识和较强的保密意识"
        ],
        "pro": [
            "hr@qiniu.com"
        ]
    }]
};
