var jobInfo = {
    "tech": [{
        "id": "0",
        "job_title": "信息安全负责人",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "参与业务系统信息安全架构设计",
            "关注信息安全发展趋势、跟进最新的安全漏洞，研究漏洞的相关原理和防御策略",
            "负责产品、系统漏洞保护，包括现有漏洞和潜在的漏洞风险，并给出修正方案",
            "负责分析、挖掘、对抗各种业务安全层面的恶意行为",
            "负责建设安全防御系统"
        ],
        "requirements": [
            "熟悉认证、文件加解密、杀毒/防木马、网络安全防御、漏洞检测、风险识别和控制等领域",
            "有丰富的经验和个人独特的体系化思考、前瞻性规划",
            "有安全产品研发经验的优先考虑",
            "熟悉业界常见安全产品或者技术、动态",
            "互联网产品信息安全、IT 内控及审计、权限管理等相关领域工作经验",
            "信息安全产品开发或者运营、实施经验者优先考虑",
            "有团队管理经验者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "1",
        "job_title": "前端开发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "配合产品经理和设计师快速实现一流的前端界面，优化代码并保持良好兼容性",
            "持续改进当前产品的前端功能，优化性能，改善访问体验",
            "主导前端框架的设计和开发"
        ],
        "requirements": [
            "熟悉 HTTP 协议、W3C 标准，熟悉页面架构和布局，能书写兼容主流浏览器的样式",
            "掌握 HTML/HTML5， CSS/CSS3, 代码结构清晰可读，易于维护",
            "熟练使用常见的 JavaScript 类库，如 jQuery Bootstrap 等",
            "熟悉主流 JavaScript框架，如 React AngularJS Vue.js Backbone.js（熟悉 Angular 者优先）",
            "熟悉前端自动化构建流程，如 Grunt Gulp Webpack",
            "熟悉 JavaScript 设计模式，能以模块化进行开发",
            "优秀的团队协作及沟通能力",
            "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物",
            "三年以上实际项目中的前端开发经验"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "2",
        "job_title": "服务端开发工程师 ",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "参与大型应用平台的后端开发"
        ],
        "requirements": [
            "参与过大型复杂项目，对复杂系统的快速拆解、理解能力",
            "编译型语言（例 C++, Java）背景，玩过或者有 Golang，Python 经验者优先，Bash 编程经验",
            "Linux 服务端开发、调试经验，熟悉网络编程、TCP、HTTP",
            "对编程、技术有热情，态度积极"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "3",
        "job_title": "数据处理&分析开发工程师 ",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "直播SDK&流媒体服务器日志收集",
            "日志数据的实时计算处理和离线计算处理",
            "依托于质量数据做直播产品的质量运营和线路调优，能够反映七牛直播云的网络拓普质量，体现数据价值",
            "通过机器学习能够做到实时或者预测线路质量，实现最终自动化运营的目标"
        ],
        "requirements": [
            "具备流式日志数据的收集知识，对于离线&实时日志数据的存储和计算有一定经验",
            "了解 flume，kafka，spark&storm，hadoop，hive 等技术",
            "对于数据挖掘和运营分析有一定经验",
            "最好具备可视化 MVC 系统的开发知识，掌握 GO，Java，Python 等其中至少一门开发语言",
            "有 CDN 调度系统的研发、调优经验者优先",
            "了解一定 HTML，CSS，JS 等前端知识",
            "最好具备一定机器学习的背景"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "4",
        "job_title": "大数据开发工程师 ",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "独立完成模块的开发、维护和优化，协助完成系统集成",
            "负责海量的 CDN 日志分析系统的设计，架构与开发工作"
        ],
        "requirements": [
            "两年以上服务端工作经验",
            "精通和熟悉至少以下主流语言中的 1 门：C/C++/Java/Python/Go/Erlang/Scala 等，熟悉 Java/Scala 语言的优先",
            "熟悉 Linux 工作环境，熟悉至少一种数据库编程",
            "拥有海量数据处理和并行计算开发以上经验优先",
            "有 CDN 调度系统的研发、调优经验者优先",
            "有过 Hadoop、Storm、Spark、Kafka、Flume 经验的优先",
            "积极主动，具备团队意识，具有高度的责任心"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "5",
        "job_title": "后端开发工程师（CDN） ",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责 CDN 管理系统的架构设计与研发工作",
            "负责 CDN 支撑系统的架构设计与研发工作"
        ],
        "requirements": [
            "计算机或相关专业本科以上学历，2 年以上系统软件开发工作经验",
            "精通 C/C++/Go 至少一门语言",
            "有大型复杂系统设计开发经验者优先",
            "有 CDN 系统开发经验者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "6",
        "job_title": "运维工程师（企业服务）",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责公司存储产品的群集搭建/交付/运维/监控/故障处理工作",
            "负责向客户交付明确的环境说明文档和技术操作规范，配合商务人员完成交付验收和故障解释工作",
            "负责突发故障的紧急响应和处理工作，紧急情况需要加班和倒班，非特殊假期需要 7X24 手机值班",
            "负责定期向客户（含内部客户）汇总报告近期的平台运营数据和过往故障整理"
        ],
        "requirements": [
            "深入理解 Linux 系统，有三年以上的系统运维经验",
            "掌握一门以上脚本语言(Shell/Perl/Python 等)，熟悉 Java/C/C++ 等开发语言者优先",
            "熟悉 NGINX、MongoDB、RabbitMQ 等服务的原理和配置，并能解析日志并排除常见故障",
            "熟悉主流分布式存储系统（Gluster/HDFS/FastDFS/Ceph）优先；也可面试前临时学习准备",
            "存储产品的运维需要很好的技术敏感度和风险识别能力；有工业场景业务运维经验者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "7",
        "job_title": "企业服务开发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "在高级工程师的指导下与客户进行需求沟通，以文档形式整理搜集客户需求",
            "结合已有存储技术和用户需求，为用户提供正式演示文档和正式交付方案",
            "深入理解项目技术需求，对客户进行现场技术宣讲和功能培训工作",
            "协助高级工程师一起推进项目的招投标工作和流程推进工作"
        ],
        "requirements": [
            "大学本科及以上学历，熟练掌握 网络/系统/存储/数据库 相关专业知识",
            "硬性要求：熟练使用 Word 和 PPT，具有良好方案撰写能力，能在简历内附带自己技术文档作品者优先",
            "良好的人际交往与沟通能力，沟通过程有说服力和亲和力，能够了解并引导客户需求，能够协调内部资源共同推进项目",
            "有云计算售前工作经验、存储项目实施经验者优先，对硬件存储了解者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "8",
        "job_title": "CDN 缓存系统开发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
            "参与七牛融合/自建缓存组件的开发和优化",
            "开发七牛 CDN 静态内容、下载、点播等系统",
            "研究和完善 ATS 的核心模块，开发 ATS 的业务插件，修复 ATS 可能出现的 Bug",
            "完善 OpenResty 相关核心功能，研究和引进社区的先进功能到生产环境",
            "开发缓存系统的刷新、预取、验证等组件，优化其性能与效率",
            "开发 WAF 模块"
        ],
        "requirements": [
            "有 Linux 系统开发经验，熟悉 C/C++/Go 等一种开发语言",
            "熟悉 TCP/IP 协议，熟悉 HTTP 协议",
            "熟悉开源 HTTP/Cache 服务器（如 TrafficServer、Squid、Varnish、Nginx、Lighttpd 等），有分析其代码实现或模块编写经验者优先",
            "熟悉 OpenResty/Nginx+Lua 开发优先",
            "有点播系统开发经验者优先",
            "熟悉常用消息队列（ZeroMQ、RabbitMQ、Kafka等）、常用RPC组件（ProtoBuf，Thrift等）者优先",
            "熟悉高并发，高性能服务器相关核心技术优先",
            "开源爱好者，Github 有知名项目者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "9",
        "job_title": "CDN 调度系统研发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
            "设计、实现、优化七牛融合/自有 CDN 的各调度系统",
            "设计、实现七牛各DNS系统的开发与设计",
            "通过技术手段，进一步提升七牛 CDN 服务稳定性与性能",
            "直接参与到系统设计和核心代码开发"
        ],
        "requirements": [
            "有 Linux 系统开发经验，熟悉 C/C++/Go 等一种开发语言",
            "熟悉 TCP/IP 协议，熟悉 HTTP 协议",
            "熟悉 CDN 原理和技术，熟悉 CDN 调度系统工作原理",
            "具有良好的沟通能力，有较强的独立工作能力和解决问题的能力",
            "有 CDN 调度系统的研发、调优经验者优先",
            "有 IP 库系统、DNS 牵引系统经验者优先",
            "具有深厚算法及数据结构知识优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "10",
        "job_title": "CDN 监控系统研发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责七牛 CDN 监控、监测、探测系统的设计与开发工作"
        ],
        "requirements": [
            "具备 Hacker 精神",
            "熟悉 C/C++/Go 至少一门编程语言",
            "熟悉 TCP/IP 协议簇，有较丰富的网络编程经验",
            "熟悉 CDN 监控系统或调度系统者优先",
            "有大型互联网后端服务器系统设计开发经验者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "11",
        "job_title": "CDN 高级运维开发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
            "服务稳定性问题追查、定位和优化，追求极致的性能，提升七牛 CDN 平台稳定性",
            "制定和优化运维解决方案，包括但不限于柔性容灾、智能调度、弹性扩容与防攻击",
            "主导业务架构的可运维性设计，参与业务系统的设计与实施",
            "设计与开发高效的自动化运维系统，使用代码解决线上问题，提升运维工作效率",
            "建设七牛自有 CDN 分发网络，机房选点建设，集群方案设计，日志流量调度，服务稳定性保证"
        ],
        "requirements": [
            "3 年以上运维开发经验，对立体监控、自动部署、容量管理、自动容灾有较深入的理解和实践经验",
            "快速定位和分析客户所遇问题，快速提供最佳解决方案",
            "实际运维工作经验，精通 Linux 操作系统、TCP/IP 等常用协议，熟悉 CDN DNS 基本原理",
            "熟练掌握 C/PHP/Python/SHELL 至少 1 至 2 种语言，并有相关运维开发经验"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "12",
        "job_title": "CDN 高级运维工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
            "以线上服务可用性与性能作为运维唯一标准，追求极致的性能与稳定，服务可用性 99.99%",
            "CDN 基础平台的日常维护，发布，扩容，监控，问题定位，保证基础服务稳定性",
            "对接技术支持组、大客户组、产品实施组，服务客户解决疑难问题，超大客户保障",
            "CDN 品控优化、问题定位和质量优化，追求极致的性能，提升七牛 CDN 平台可用性与性能",
            "参与建设七牛自有 CDN 分发网络，机房选点建设，集群方案设计，日志流量调度，服务稳定性保证"
        ],
        "requirements": [
            "2 年以上 CDN 运维经验，熟悉 CDN 各个环节的实现原理以及故障排查方法",
            "实际运维工作经验，精通 Linux 操作系统、TCP/IP、HTTP 等常用协议，熟悉 CDN DNS 基本原理",
            "熟悉 LVS、Nginx、ATS、Squid，具有安装配置运维的能力",
            "熟练掌握 Python/SHEL L至少 1 至 2 种语言，能够编写运维自动化脚本"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "13",
        "job_title": "前端开发工程师-AngularJS",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [],
        "requirements": [
            "熟悉 HTML、CSS，熟悉页面架构和布局",
            "熟悉 JavaScript，熟练使用常见的 JavaScript 类库",
            "了解 W3C/HTTP 规范",
            "良好的团队协作及沟通能力",
            "熟悉或了解 AngularJS 框架优先",
            "有 Flex/ActionScript 开发经验者优先",
            "有可以实际展示的前端项目或作品优先",
            "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "14",
        "job_title": "块存储 (Ceph/Cinder) 研发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责块存储技术研发与应用"
        ],
        "requirements": [
            "熟悉对象存储/块存储/文件存储相关知识",
            "熟悉 Linux/Unix 操作系统下 C/C++ 开发",
            "熟悉 Linux/Unix 操作系统 IO 知识与优化",
            "熟悉 Linux/Unix 环境下 debug/trace 相关技术",
            "熟悉 Ceph 架构设计与应用实践",
            "有良好的学习能力和良好的团队协作能力"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "15",
        "job_title": "iOS 技术支持工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "代表公司接入并服务客户",
            "参与改善公司客户服务流程，参与开发客户服务内部系统",
            "负责公司产品 iOS 语言 SDK 的客户支持服务"
        ],
        "requirements": [
            "熟练掌握 Objective-C 有 Swift 经验者优先",
            "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
            "对流媒体开发有一定了解",
            "热爱分享，较好的文档写作能力"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "16",
        "job_title": "Android 技术支持工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "代表公司接入并服务客户",
            "参与改善公司客户服务流程，参与开发客户服务内部系统",
            "负责公司产品 Android 语言 SDK 的客户支持服务"
        ],
        "requirements": [
            "本科及以上学历、计算机相关专业、基础扎实",
            "熟悉 Android 开发语言，有 Android App 或者 系统开发经验，最好熟悉多媒体，网络交互等模块",
            "至少熟悉一门服务端或者客户端编程语言如 Golang/Python/PHP/Ruby/Java/Objective-C 等",
            "热爱分享，较好的文档写作能力"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "17",
        "job_title": "服务端技术支持工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "代表公司接入并服务客户",
            "参与改善公司客户服务流程，参与开发客户服务内部系统",
            "负责应用系统的性能分析与系统优化，不断提高系统运行效率",
            "根据客户需求，帮助公司改善产品甚至探讨方向、策略"
        ],
        "requirements": [
            "本科及以上学历、计算机相关专业、基础扎实",
            "熟悉 TCP/HTTP 协议，熟悉 CDN & DNS 基本原理",
            "1 年以上研发经验，服务端研发优先。精通和熟悉主流语言的至少一门：C/C++/Java/Python/Go/Ruby/Erlang 等",
            "热爱分享，较好的文档写作能力",
            "有云服务技术支持经验者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "18",
        "job_title": "BI 数据分析工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "为客户问题和内部工作任务基础数据，作数据整合，各维度分析，为公司量化决策管理提供支撑",
            "参与量化模型开发与维护，BI 系统建设、报表自动化等项目",
            "和前端工程师配合，提供数据可视化支持"
        ],
        "requirements": [
            "2 年及以上数据分析相关工作经验",
            "熟悉 Highchart 等前端图形报表插件",
            "基础扎实，有良好的逻辑思维能力，并熟练一到两种后端语言（Golang / Python / PHP / Java / Ruby），拥有良好的代码书写习惯",
            "熟悉 MySQL、MongoDB",
            "熟悉 Linux/Unix 系统与开发环境，熟悉 TCP/IP、HTTP 协议",
            "加分项: 熟悉 Go 语言,Github star 100+ 以上,参与过开源项目"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "19",
        "job_title": "Web 前端开发工程师",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责 Web 前端界面，Web 和部分后端服务程序的研发和编写",
            "和后端工程师配合，商定数据接口",
            "和 BI 工程师配合，提供数据可视化支持",

        ],
        "requirements": [
            "2 年及以上 Web 前端工作经验",
            "精通前端基本技术 HTML, CSS, JavaScript",
            "熟悉 CoffeeScript, AngularJS, Gulp",
            "熟悉 Highchart 等前端图形报表插件",
            "基础扎实，有良好的逻辑思维能力，并熟练一到两种后端语言（Golang / Python / PHP / Java / Ruby），拥有良好的代码书写习惯",
            "熟悉 MySQL、MongoDB",
            "熟悉 Linux/Unix 系统与开发环境，熟悉 TCP/IP, HTTP 协议并了解 RESTful 规范",
            "加分项: 熟悉 Go 语言,Github star 100+ 以上,参与过开源项目"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "20",
        "job_title": "Web 前端开发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [],
        "requirements": [
            "熟悉 HTML, CSS,熟悉页面架构和布局（如 Bootstrap）",
            "熟悉 JavaScript，熟练使用常见的 JavaScript 类库",
            "了解 W3C/HTTP 规范",
            "良好的团队协作及沟通能力",
            "熟悉主流的SPA框架(React、Angular 等)",
            "熟悉 HTTP 协议，了解 Web 安全",
            "熟悉 Gulp、Webpack 构建过程",
            "有服务器开发经历，有 Node.js，Golang，Python 或 Ruby 经验者优先",
            "熟悉 RESTful API，有基于 RESTful API 的开发经验",
            "对前端技术有持续的激情，追求最佳用户体验，责任心强，善于学习新事物"

        ],
        "pro": ["hr@qiniu.com"]
    },{
        "id": "21",
        "job_title": "测试开发工程师",
        "place": [
            "北京"
        ],
        "time": "2016/8/31",
        "duty": [
          "与研发人员紧密合作，参与产品需求，系统设计及代码评审工作，并提出改进意见",
          "根据产品和项目特点，提出合理的自动化测试解决方案，并负责设计和实现自动化测试工具，提高测试效率",
          "定位产品软件中的缺陷和问题，跟踪产品版本与质量",
          "维护测试环境，维护持续集成框架，执行自动化回归测试"

      ],
        "requirements": [
            "熟悉至少一种编程语言：Java/C/C++/Go 等，有 Go 经验者优先",
            "熟悉 Unix/Linux工作环境，至少掌握一门常用脚本语言（包括不限于 Shell、Perl、Python、Ruby）",
            "有较强的接口自动化测试经验，开发过自动化框架者更佳",
            "熟悉白盒测试，有较强的分析和解决复杂问题的能力",
            "有强烈的责任心，工作态度严谨，能承担较大工作压力，具备良好的沟通能力和团队合作精神",
            "热衷技术探索，能够持续提高工作效率"
        ],
        "pro": ["hr@qiniu.com"]
    },{
        "id": "22",
        "job_title": "公有云存储运营经理",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
          "主导公有云存储的运营工作，配合研发与销售，提高产品的销量",
          "发掘各行业客户的存储量变化趋势与特征，评估增量潜力与影响因素，拟定销售策略，推动商务经理与售前工程师跟进拉升存储量",
          "关注各行业存储需求演化趋势，分析评估需求可行性、重要性与优先度，配合产品经理推动相关功能研发落地",
          "定期撰写存储运营报告，与存储产品团队共同研判发展方向，阶段性调整发展策略"

      ],
        "requirements": [
            "具备系统性观察分析存储产品的能力",
            "具备宽广的行业视野与业务知识",
            "具备基本的运营数字分析能力，熟练使用各类运营分析工具",
            "有云存储/公有云行业从业经验 2 年以上者优先",
            "沟通能力优异者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }],
    "business": [{
        "id": "0",
        "job_title": "SEO",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责提高各关键字在各大搜索引擎的排名，增加网站流量以及注册用户数",
            "负责监控和提高网站访问量、注册用户数、PR、PV 等站点综合指数",
            "负责关键词提炼，标题、网页描述的撰写工作；对竞价关键词进行整理和数据分析，能有效的对其进行评估，并优化推广方案",
            "对百度、Google 等帐户进行操作管理、数据整理及数据分析，负责推广账户创意制定、广告投放、效果分析"
        ],
        "requirements": [
            "对百度竟价系统、谷歌网站联盟系统有丰富的实操经验",
            "有互联网推广资源（如网站站长、网络联盟、版主、网络媒体等资源）者优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "1",
        "job_title": "技术编辑",
        "place": [
            "上海"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责市场部对外文章、文案等内容的日常维护和更新",
            "负责对技术和行业热点的发掘和报道，及相应选题点的策划及执行",
            "负责网站内容合作伙伴、专家作者的联系与维护"
        ],
        "requirements": [
            "计算机及相关专业的应届生或有一两年相关工作经验的毕业生",
            "最好能对云计算领域或移动创业有一定关注，有自己的理解和思考",
            "本科及以上学历，有良好的中文写作和英文翻译功底",
            "学习能力强，有一定的抗压能力"
        ],
        "pro": ["hr@qiniu.com"]
    }],
    "product": [],
    "design": [],
    "marketing": [{
        "id": "0",
        "job_title": "大客户经理",
        "place": [
            "上海",
            "北京",
            "深圳",
            "广州",
            "杭州"
        ],
        "time": "2016/9/1",
        "duty": [
            "挖掘公司云存储服务在各行业尤其是移动互联网行业的销售机会",
            "清楚描述潜在客户在数据存储、CDN 加速等领域的需求",
            "组织协调公司技术资源满足客户的解决方案需求",
            "负责大客户的合同签署，收款跟进和关系维护，形成持续的合作"
        ],
        "requirements": [
            "3 年以上移动互联网、CDN、云计算基础硬件设施等行业的销售或市场经验",
            "热爱各种社交产品微博、微信等各种移动互联创新产品和工具",
            "了解国内外主流云平台服务商 例如 AWS、阿里云、百度云等产品",
            "具有很强的逻辑思维和分析能力，善于分析各种竞合关系",
            "有在存储类产品、CDN 行业售前或销售经验、计算机或信息技术相关专业的优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "1",
        "job_title": "高级销售经理",
        "place": [
            "上海",
            "广州",
            "深圳"
        ],
        "time": "2016/8/31",
        "duty": [
            "从事云存储、融合 CDN 产品的销售工作，达成销售指标，扩大产品的市场占有率",
            "根据公司市场战略，开拓新市场和新客户，维护客户关系，扩大公司业务量",
            "收集各种有关市场销售信息，及时反馈客户资源信息，提出有效的市场运作及销售建议",
            "为不同类型的商业客户提供技术解决方案",
            "准备客户的销售计划、技术交流、Demo、建议书",
            "完成公司分配的销售业绩目标"
        ],
        "requirements": [
            "计算机或相关专业专科以上学历",
            "掌握完善的销售技巧，具备优秀的与客户沟通能力，思维敏捷",
            "两年以上 IT 行业销售工作经验，良好的互联网站客户基础",
            "有 IT 行业售前工程师或技术支持工程师工作经验",
            "有 CDN、云服务技术或销售经验者优先考虑",
            "擅长与人交流合作，具有团队精神",
            "工作中具有较强的主动性、积极性与创造性"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "2",
        "job_title": "售前工程师",
        "place": [
            "上海",
            "北京",
            "杭州",
            "广州"
        ],
        "time": "2016/8/31",
        "duty": [
            "配合销售跟客户沟通，收集客户业务信息、应用场景信息，整理出有效需求，分解成功能需求列表",
            "将功能需求列表转化为整体解决方案交付给客户，协调其它部门资源，推进实施方案",
            "收集各种有关市场销售信息，及时反馈客户资源信息，提出有效的市场运作及销售建议",
            "协助销售人员提升客户满意度，提升公司整体销售业绩",
            "编写行业解决方案文档，定期维护更新，追随云计算、云存储行业的趋势",
            "完成公司分配的销售业绩目标推动其它部门实现合理的功能需求，编写使用文档，整合进解决方案中",
            "参与线下IT论坛、会议，宣传理念、服务与解决方案"
        ],
        "requirements": [
            "优秀的沟通表达和协调能力，系统的思考能力",
            "云计算、IT 服务领域 3 年以上售前工程师相关岗位工作经验",
            "能熟悉使用各种办公软件撰写文档和解决方案",
            "计算机科学与技术、信息科学与技术相关专业大学本科以上学历",
            "有 C 语言、C++ 等编程语言一年以上的开发工作经验优先",
            "熟悉移动互联网创业或者自己有创业经历的优先"
        ],
        "pro": ["hr@qiniu.com"]
    }, {
        "id": "3",
        "job_title": "商业拓展专员－BD",
        "place": [
            "深圳"
        ],
        "time": "2016/8/31",
        "duty": [
            "负责商务拓展策略和实施，正确传递公司产品价值",
            "通过电话、QQ、邮件等工具对潜在客户进行沟通，搜集和分析潜在客户信息",
            "挖掘注册客户的需求，分解需求并正确客观地提交至相关部门",
            "响应客户要求，为客户解决问题，收集用户反馈，提高客户满意度，并做好相关记录",
            "定期关怀用户，定期汇总工作进度报告，为注册平台工作提供依据"
        ],
        "requirements": [
            "大专及以上学历",
            "具备良好的沟通能力，口齿清晰，普通话标准流利，亲和力强，语音富有感染力",
            "乐观进取，耐心细致，性格坚韧，思维敏捷，有强烈的责任心",
            "综合素质强，具备良好的协调、应变、承压能力",
            "具备良好职业道德及团队合作精神，有敏锐的市场洞察力、高度的服务意识和积极的工作态度",
            "熟练使用办公软件，有企业服务电话销售经验、了解云计算行业者优先，有潜力的新人可培养"
        ],
        "pro": ["hr@qiniu.com"]
    }],
    "function": []
};
